{
  "cat_vocabs": {
    "pitcher": {
      "684007": 1,
      "808967": 2,
      "676962": 3,
      "607455": 4,
      "676508": 5,
      "669212": 6,
      "595014": 7,
      "518489": 8,
      "656945": 9,
      "657006": 10,
      "808963": 11,
      "472610": 12,
      "663878": 13,
      "676263": 14,
      "573204": 15,
      "689017": 16,
      "657240": 17,
      "687863": 18,
      "489446": 19,
      "519151": 20,
      "681911": 21,
      "650633": 22,
      "519242": 23,
      "689690": 24,
      "673513": 25,
      "669093": 26,
      "669276": 27,
      "593576": 28,
      "607481": 29,
      "592094": 30,
      "656550": 31,
      "663158": 32,
      "605483": 33,
      "669373": 34,
      "605154": 35,
      "669724": 36,
      "689225": 37,
      "669302": 38,
      "622663": 39,
      "621053": 40,
      "663423": 41,
      "600917": 42,
      "519008": 43,
      "662253": 44,
      "543243": 45,
      "641154": 46,
      "681517": 47,
      "667463": 48,
      "686973": 49,
      "688297": 50,
      "663485": 51,
      "664208": 52,
      "643377": 53,
      "623437": 54,
      "664854": 55,
      "668678": 56,
      "669194": 57,
      "656222": 58,
      "686826": 59,
      "543135": 60,
      "676979": 61,
      "676477": 62,
      "676395": 63,
      "455119": 64,
      "547973": 65,
      "592426": 66,
      "542888": 67,
      "686580": 68,
      "680732": 69,
      "579328": 70,
      "682171": 71,
      "696270": 72,
      "673929": 73,
      "605182": 74,
      "592155": 75,
      "669022": 76,
      "554430": 77,
      "678606": 78,
      "689147": 79,
      "605447": 80,
      "640448": 81,
      "621237": 82,
      "621363": 83,
      "674285": 84,
      "621381": 85,
      "621244": 86,
      "621107": 87,
      "663992": 88,
      "606930": 89,
      "643338": 90,
      "622554": 91,
      "684320": 92,
      "669211": 93,
      "680704": 94,
      "607074": 95,
      "642547": 96,
      "657612": 97,
      "663542": 98,
      "643410": 99,
      "657649": 100,
      "606303": 101,
      "596133": 102,
      "641302": 103,
      "642207": 104,
      "666142": 105,
      "594902": 106,
      "672582": 107,
      "671922": 108,
      "668674": 109,
      "682120": 110,
      "640451": 111,
      "683769": 112,
      "608032": 113,
      "661403": 114,
      "669674": 115,
      "623149": 116,
      "664285": 117,
      "605280": 118,
      "623211": 119,
      "650556": 120,
      "664849": 121,
      "623352": 122,
      "668881": 123,
      "657277": 124,
      "605130": 125,
      "678495": 126,
      "641941": 127,
      "669062": 128,
      "663574": 129,
      "643511": 130,
      "664139": 131,
      "594580": 132,
      "676254": 133,
      "645261": 134,
      "694973": 135,
      "669199": 136,
      "642701": 137,
      "621366": 138,
      "666277": 139,
      "657571": 140,
      "670059": 141,
      "622786": 142,
      "670280": 143,
      "686613": 144,
      "656731": 145,
      "657585": 146,
      "595345": 147,
      "621345": 148,
      "605463": 149,
      "687911": 150,
      "592773": 151,
      "664351": 152,
      "621242": 153,
      "622491": 154,
      "605488": 155,
      "666619": 156,
      "660825": 157,
      "642048": 158,
      "686993": 159,
      "672841": 160,
      "687765": 161,
      "656302": 162,
      "625643": 163,
      "670970": 164,
      "572955": 165,
      "678226": 166,
      "518876": 167,
      "592791": 168,
      "657044": 169,
      "573009": 170,
      "641745": 171,
      "571946": 172,
      "656427": 173,
      "663947": 174,
      "676684": 175,
      "592454": 176,
      "687362": 177,
      "656605": 178,
      "663969": 179,
      "685107": 180,
      "592332": 181,
      "450203": 182,
      "544150": 183,
      "554340": 184,
      "672335": 185,
      "663893": 186,
      "642397": 187,
      "683004": 188,
      "656557": 189,
      "669711": 190,
      "687847": 191,
      "571948": 192,
      "657514": 193,
      "657097": 194,
      "686752": 195,
      "607536": 196,
      "685801": 197,
      "641755": 198,
      "683409": 199,
      "682254": 200,
      "680767": 201,
      "664126": 202,
      "681190": 203,
      "680885": 204,
      "593974": 205,
      "660853": 206,
      "682243": 207,
      "674370": 208,
      "676092": 209,
      "663687": 210,
      "668716": 211,
      "642100": 212,
      "695243": 213,
      "607200": 214,
      "657746": 215,
      "660896": 216,
      "681676": 217,
      "543056": 218,
      "668941": 219,
      "661395": 220,
      "607625": 221,
      "668909": 222,
      "663738": 223,
      "596001": 224,
      "681293": 225,
      "656288": 226,
      "676130": 227,
      "668820": 228,
      "641816": 229,
      "621111": 230,
      "458677": 231,
      "642520": 232,
      "677161": 233,
      "694297": 234,
      "679885": 235,
      "681857": 236,
      "676428": 237,
      "628317": 238,
      "686563": 239,
      "667755": 240,
      "669060": 241,
      "690829": 242,
      "445276": 243,
      "663623": 244,
      "666200": 245,
      "608371": 246,
      "687377": 247,
      "614179": 248,
      "621383": 249,
      "672578": 250,
      "605452": 251,
      "453286": 252,
      "665152": 253,
      "666974": 254,
      "656546": 255,
      "642585": 256,
      "641793": 257,
      "622608": 258,
      "678821": 259,
      "623474": 260,
      "664076": 261,
      "518397": 262,
      "655889": 263,
      "687330": 264,
      "678020": 265,
      "608331": 266,
      "641482": 267,
      "671162": 268,
      "672782": 269,
      "665625": 270,
      "687396": 271,
      "694477": 272,
      "471911": 273,
      "641343": 274,
      "678368": 275,
      "663559": 276,
      "678692": 277,
      "664875": 278,
      "669622": 279,
      "676534": 280,
      "666214": 281,
      "641835": 282,
      "666157": 283,
      "434378": 284,
      "702352": 285,
      "668933": 286,
      "642152": 287,
      "676440": 288,
      "608379": 289,
      "608717": 290,
      "670167": 291,
      "676282": 292,
      "693433": 293,
      "676664": 294,
      "601713": 295,
      "700363": 296,
      "660761": 297,
      "593958": 298,
      "571510": 299,
      "607067": 300,
      "640462": 301,
      "594798": 302,
      "690916": 303,
      "669467": 304,
      "641927": 305,
      "677976": 306,
      "571927": 307,
      "676974": 308,
      "571760": 309,
      "675540": 310,
      "607259": 311,
      "592662": 312,
      "573124": 313,
      "608718": 314,
      "666808": 315,
      "573186": 316,
      "650644": 317,
      "656730": 318,
      "642232": 319,
      "671737": 320,
      "663372": 321,
      "656234": 322,
      "670955": 323,
      "605135": 324,
      "608372": 325,
      "621199": 326,
      "641329": 327,
      "680730": 328,
      "605400": 329,
      "605347": 330,
      "695418": 331,
      "663436": 332,
      "686799": 333,
      "666171": 334,
      "656271": 335,
      "686642": 336,
      "676106": 337,
      "695549": 338,
      "606996": 339,
      "682847": 340,
      "663474": 341,
      "607192": 342,
      "445926": 343,
      "628452": 344,
      "683155": 345,
      "640902": 346,
      "650911": 347,
      "608566": 348,
      "687134": 349,
      "571945": 350,
      "542881": 351,
      "672282": 352,
      "680729": 353,
      "660730": 354,
      "663460": 355,
      "681982": 356,
      "669854": 357,
      "663855": 358,
      "687473": 359,
      "606160": 360,
      "527048": 361,
      "663978": 362,
      "670766": 363,
      "678024": 364,
      "685126": 365,
      "670102": 366,
      "647336": 367,
      "656876": 368,
      "669387": 369,
      "669438": 370,
      "615698": 371,
      "656849": 372,
      "678215": 373,
      "663903": 374,
      "677958": 375,
      "700249": 376,
      "656794": 377,
      "681867": 378,
      "671106": 379,
      "678316": 380,
      "663554": 381,
      "646242": 382,
      "669160": 383,
      "547179": 384,
      "682842": 385,
      "669713": 386,
      "681343": 387,
      "680573": 388,
      "592866": 389,
      "689254": 390,
      "701542": 391,
      "669203": 392,
      "518585": 393,
      "493603": 394,
      "669358": 395,
      "802419": 396,
      "669461": 397,
      "543294": 398,
      "666120": 399,
      "673540": 400,
      "686730": 401,
      "622780": 402,
      "693821": 403,
      "694738": 404,
      "806185": 405,
      "687922": 406,
      "592836": 407,
      "622379": 408,
      "702674": 409,
      "534910": 410,
      "801403": 411,
      "663767": 412,
      "670810": 413,
      "690928": 414,
      "700669": 415,
      "656240": 416,
      "669422": 417,
      "476594": 418,
      "683232": 419,
      "571578": 420,
      "656457": 421,
      "641656": 422,
      "670174": 423,
      "680736": 424,
      "671131": 425,
      "681882": 426,
      "596271": 427,
      "656986": 428,
      "681799": 429,
      "682990": 430,
      "669920": 431,
      "701581": 432,
      "500779": 433,
      "605507": 434,
      "701121": 435,
      "690382": 436,
      "665795": 437,
      "674444": 438,
      "676961": 439,
      "669372": 440,
      "682610": 441,
      "681892": 442,
      "642121": 443,
      "671096": 444,
      "693312": 445,
      "669371": 446,
      "671212": 447,
      "656848": 448,
      "605242": 449,
      "679358": 450,
      "694037": 451,
      "681895": 452,
      "664747": 453,
      "668984": 454,
      "676272": 455,
      "681432": 456,
      "672456": 457,
      "675911": 458,
      "663795": 459,
      "657376": 460,
      "700187": 461,
      "694335": 462,
      "621051": 463,
      "682052": 464,
      "696136": 465,
      "623465": 466,
      "687287": 467,
      "666661": 468,
      "656420": 469,
      "687064": 470,
      "694363": 471,
      "592779": 472,
      "686753": 473,
      "701656": 474,
      "687606": 475,
      "622253": 476,
      "521230": 477,
      "806188": 478,
      "547001": 479,
      "691094": 480,
      "688642": 481,
      "677020": 482,
      "666215": 483,
      "677955": 484,
      "668970": 485,
      "690544": 486,
      "695445": 487,
      "678394": 488,
      "666659": 489,
      "686249": 490,
      "656641": 491,
      "684974": 492,
      "605218": 493,
      "663562": 494,
      "687849": 495,
      "680880": 496,
      "668964": 497,
      "675848": 498,
      "692285": 499,
      "700270": 500,
      "519141": 501,
      "682989": 502,
      "691594": 503,
      "686701": 504,
      "676617": 505,
      "820862": 506,
      "680951": 507,
      "663465": 508,
      "674944": 509,
      "664991": 510,
      "688138": 511,
      "671109": 512,
      "669721": 513,
      "680689": 514,
      "680742": 515,
      "660787": 516,
      "554431": 517,
      "570632": 518,
      "675989": 519,
      "669717": 520,
      "672391": 521,
      "641540": 522,
      "571771": 523,
      "643361": 524,
      "502043": 525,
      "676702": 526,
      "676680": 527,
      "664062": 528,
      "805123": 529,
      "702070": 530,
      "608337": 531,
      "641778": 532,
      "663399": 533,
      "656464": 534,
      "606965": 535,
      "695534": 536,
      "687074": 537,
      "650893": 538,
      "686654": 539,
      "682825": 540,
      "623167": 541,
      "670036": 542,
      "620454": 543,
      "680684": 544,
      "664199": 545,
      "666374": 546,
      "691172": 547,
      "605177": 548,
      "543518": 549,
      "657053": 550,
      "663568": 551,
      "663432": 552,
      "694918": 553,
      "681810": 554,
      "621121": 555,
      "624133": 556,
      "700241": 557,
      "674072": 558,
      "673380": 559,
      "673965": 560,
      "690986": 561,
      "694350": 562,
      "641401": 563,
      "685299": 564,
      "676701": 565,
      "641312": 566,
      "691441": 567,
      "669308": 568,
      "665660": 569,
      "607732": 570,
      "690990": 571,
      "680755": 572,
      "681869": 573,
      "608665": 574,
      "669020": 575,
      "671305": 576,
      "683627": 577,
      "676467": 578,
      "677960": 579,
      "642016": 580,
      "694646": 581,
      "640454": 582,
      "687424": 583,
      "668390": 584,
      "687223": 585,
      "702795": 586,
      "612434": 587,
      "657756": 588,
      "642528": 589,
      "595897": 590,
      "642239": 591,
      "477132": 592,
      "677944": 593,
      "805673": 594,
      "669704": 595,
      "690953": 596,
      "621512": 597,
      "676661": 598,
      "519326": 599,
      "605288": 600,
      "687888": 601,
      "552640": 602,
      "668834": 603,
      "679922": 604,
      "681347": 605,
      "692230": 606,
      "676755": 607,
      "669923": 608,
      "676083": 609,
      "669432": 610,
      "621139": 611,
      "663941": 612,
      "676879": 613,
      "663671": 614,
      "688158": 615,
      "677952": 616,
      "669084": 617,
      "682274": 618,
      "596112": 619,
      "663804": 620,
      "680604": 621,
      "689958": 622,
      "676969": 623,
      "689266": 624,
      "676475": 625,
      "656257": 626,
      "694851": 627,
      "656186": 628,
      "699134": 629,
      "657024": 630,
      "681916": 631,
      "621112": 632,
      "676051": 633,
      "687830": 634,
      "663546": 635,
      "489119": 636,
      "691951": 637,
      "547184": 638,
      "681146": 639,
      "686751": 640,
      "518886": 641,
      "660604": 642,
      "670950": 643,
      "801216": 644,
      "686747": 645,
      "656629": 646,
      "679775": 647,
      "691587": 648,
      "693855": 649,
      "691799": 650,
      "621057": 651,
      "605513": 652,
      "669391": 653,
      "675650": 654,
      "694819": 655,
      "701552": 656,
      "657424": 657,
      "682515": 658,
      "696147": 659,
      "543101": 660,
      "664192": 661,
      "676206": 662,
      "596295": 663,
      "647315": 664,
      "660271": 665,
      "664123": 666,
      "663321": 667,
      "686218": 668,
      "677865": 669,
      "800049": 670,
      "669193": 671,
      "683175": 672,
      "682790": 673,
      "800311": 674,
      "673820": 675,
      "694361": 676,
      "669449": 677,
      "801434": 678,
      "664141": 679,
      "681006": 680,
      "678022": 681,
      "680735": 682,
      "676604": 683,
      "663773": 684,
      "642216": 685,
      "695505": 686,
      "593423": 687,
      "702752": 688,
      "608650": 689,
      "676609": 690,
      "681870": 691,
      "607179": 692,
      "669684": 693,
      "697812": 694,
      "595928": 695,
      "693313": 696,
      "663362": 697,
      "686228": 698,
      "664129": 699,
      "656686": 700,
      "663765": 701,
      "691251": 702,
      "674384": 703,
      "690925": 704,
      "696131": 705,
      "701519": 706,
      "681751": 707,
      "682144": 708,
      "829272": 709,
      "666168": 710,
      "621114": 711,
      "670329": 712,
      "605540": 713,
      "642759": 714,
      "506433": 715,
      "692024": 716,
      "663462": 717,
      "693645": 718,
      "608334": 719,
      "664948": 720,
      "685314": 721,
      "667297": 722,
      "670990": 723,
      "593833": 724,
      "640455": 725,
      "548384": 726,
      "805299": 727,
      "683618": 728,
      "663455": 729,
      "448179": 730,
      "675512": 731,
      "592351": 732,
      "650671": 733,
      "641386": 734,
      "623433": 735,
      "676760": 736,
      "687931": 737,
      "701487": 738,
      "543859": 739,
      "645305": 740,
      "681168": 741,
      "669459": 742,
      "806960": 743,
      "699911": 744,
      "641672": 745,
      "664294": 746,
      "694462": 747,
      "678906": 748,
      "661563": 749,
      "541640": 750,
      "670912": 751,
      "676571": 752,
      "676742": 753,
      "543391": 754,
      "676917": 755,
      "664299": 756,
      "502085": 757,
      "665871": 758,
      "663558": 759,
      "679883": 760,
      "676775": 761,
      "690997": 762,
      "622503": 763,
      "676510": 764,
      "656638": 765,
      "800048": 766,
      "666711": 767,
      "696149": 768,
      "656458": 769,
      "669456": 770,
      "805427": 771,
      "672724": 772,
      "687209": 773,
      "681217": 774,
      "687003": 775,
      "685326": 776,
      "680701": 777,
      "680694": 778,
      "624512": 779,
      "669620": 780,
      "661527": 781,
      "686676": 782,
      "672710": 783,
      "688497": 784,
      "660644": 785,
      "804636": 786,
      "620443": 787,
      "801139": 788,
      "686930": 789,
      "680837": 790,
      "674841": 791,
      "677651": 792,
      "669330": 793,
      "691548": 794,
      "802686": 795,
      "815083": 796,
      "665665": 797,
      "681151": 798,
      "685005": 799,
      "687075": 800,
      "675919": 801,
      "671111": 802,
      "813349": 803,
      "680702": 804,
      "689520": 805,
      "670183": 806,
      "685068": 807,
      "641585": 808,
      "664353": 809,
      "702056": 810,
      "686790": 811,
      "687589": 812,
      "691769": 813,
      "677961": 814,
      "669947": 815,
      "664744": 816,
      "688107": 817,
      "669145": 818,
      "682995": 819,
      "687166": 820,
      "692030": 821,
      "592254": 822
    },
    "batter": {
      "660271": 1,
      "606192": 2,
      "664023": 3,
      "673548": 4,
      "663656": 5,
      "669257": 6,
      "571970": 7,
      "571771": 8,
      "624424": 9,
      "500743": 10,
      "807713": 11,
      "621020": 12,
      "665804": 13,
      "669242": 14,
      "683737": 15,
      "681624": 16,
      "691718": 17,
      "542932": 18,
      "457759": 19,
      "608348": 20,
      "595777": 21,
      "663586": 22,
      "621566": 23,
      "542303": 24,
      "645277": 25,
      "665487": 26,
      "650333": 27,
      "592518": 28,
      "593428": 29,
      "701538": 30,
      "493329": 31,
      "606115": 32,
      "672284": 33,
      "630105": 34,
      "663604": 35,
      "671739": 36,
      "657757": 37,
      "553869": 38,
      "686948": 39,
      "455117": 40,
      "650402": 41,
      "605141": 42,
      "679529": 43,
      "622534": 44,
      "690993": 45,
      "595879": 46,
      "628451": 47,
      "668670": 48,
      "668952": 49,
      "518692": 50,
      "682985": 51,
      "656716": 52,
      "681481": 53,
      "700242": 54,
      "671732": 55,
      "667670": 56,
      "668709": 57,
      "677594": 58,
      "663728": 59,
      "669127": 60,
      "609280": 61,
      "691016": 62,
      "593871": 63,
      "642133": 64,
      "691777": 65,
      "805779": 66,
      "641487": 67,
      "645302": 68,
      "670042": 69,
      "570482": 70,
      "668227": 71,
      "669208": 72,
      "621043": 73,
      "663457": 74,
      "575929": 75,
      "680977": 76,
      "571448": 77,
      "676475": 78,
      "671056": 79,
      "663616": 80,
      "680777": 81,
      "664056": 82,
      "691023": 83,
      "691026": 84,
      "670242": 85,
      "664034": 86,
      "650489": 87,
      "669304": 88,
      "621439": 89,
      "687363": 90,
      "666971": 91,
      "647304": 92,
      "663538": 93,
      "553993": 94,
      "664983": 95,
      "672695": 96,
      "606466": 97,
      "682998": 98,
      "672515": 99,
      "656976": 100,
      "646240": 101,
      "608324": 102,
      "543760": 103,
      "608369": 104,
      "694671": 105,
      "666969": 106,
      "692225": 107,
      "669394": 108,
      "673962": 109,
      "607680": 110,
      "543309": 111,
      "669701": 112,
      "657136": 113,
      "596115": 114,
      "677800": 115,
      "680776": 116,
      "671213": 117,
      "678882": 118,
      "592626": 119,
      "621493": 120,
      "694384": 121,
      "545361": 122,
      "624585": 123,
      "641313": 124,
      "678246": 125,
      "673357": 126,
      "643217": 127,
      "683734": 128,
      "681351": 129,
      "666176": 130,
      "621028": 131,
      "596103": 132,
      "672820": 133,
      "676070": 134,
      "572191": 135,
      "650859": 136,
      "686676": 137,
      "660162": 138,
      "677347": 139,
      "607208": 140,
      "547180": 141,
      "664761": 142,
      "682928": 143,
      "671277": 144,
      "592663": 145,
      "596146": 146,
      "605137": 147,
      "657557": 148,
      "592206": 149,
      "681082": 150,
      "669016": 151,
      "686611": 152,
      "696285": 153,
      "656941": 154,
      "663993": 155,
      "660688": 156,
      "695578": 157,
      "668939": 158,
      "656811": 159,
      "666182": 160,
      "665489": 161,
      "623993": 162,
      "641933": 163,
      "663624": 164,
      "656775": 165,
      "602104": 166,
      "702616": 167,
      "665926": 168,
      "672386": 169,
      "681297": 170,
      "676059": 171,
      "695238": 172,
      "676391": 173,
      "702176": 174,
      "543807": 175,
      "694192": 176,
      "592885": 177,
      "661388": 178,
      "592450": 179,
      "641355": 180,
      "502671": 181,
      "686217": 182,
      "687401": 183,
      "669003": 184,
      "665862": 185,
      "691176": 186,
      "681962": 187,
      "665828": 188,
      "669224": 189,
      "668930": 190,
      "683011": 191,
      "700250": 192,
      "656555": 193,
      "663757": 194,
      "686555": 195,
      "641343": 196,
      "608070": 197,
      "657041": 198,
      "467793": 199,
      "700932": 200,
      "678877": 201,
      "677951": 202,
      "686469": 203,
      "677587": 204,
      "521692": 205,
      "686681": 206,
      "669004": 207,
      "680757": 208,
      "624415": 209,
      "663697": 210,
      "666310": 211,
      "592669": 212,
      "672580": 213,
      "664728": 214,
      "672356": 215,
      "592192": 216,
      "596019": 217,
      "665742": 218,
      "624413": 219,
      "607043": 220,
      "514888": 221,
      "670623": 222,
      "670541": 223,
      "516782": 224,
      "621438": 225,
      "682668": 226,
      "620443": 227,
      "665161": 228,
      "663898": 229,
      "668901": 230,
      "572233": 231,
      "701358": 232,
      "676694": 233,
      "673237": 234,
      "664774": 235,
      "642715": 236,
      "808982": 237,
      "670770": 238,
      "680574": 239,
      "682829": 240,
      "668715": 241,
      "656305": 242,
      "671218": 243,
      "687952": 244,
      "573262": 245,
      "666149": 246,
      "666158": 247,
      "624431": 248,
      "600869": 249,
      "641584": 250,
      "527038": 251,
      "674441": 252,
      "502054": 253,
      "668804": 254,
      "669364": 255,
      "681146": 256,
      "693304": 257,
      "672640": 258,
      "682848": 259,
      "643396": 260,
      "688363": 261,
      "669065": 262,
      "663698": 263,
      "457705": 264,
      "670223": 265,
      "663647": 266,
      "665833": 267,
      "656537": 268,
      "663743": 269,
      "667472": 270,
      "608385": 271,
      "683146": 272,
      "456781": 273,
      "664238": 274,
      "641598": 275,
      "649966": 276,
      "518792": 277,
      "669397": 278,
      "677950": 279,
      "645444": 280,
      "605131": 281,
      "693307": 282,
      "665052": 283,
      "689414": 284,
      "624428": 285,
      "676572": 286,
      "664770": 287,
      "622761": 288,
      "641680": 289,
      "665750": 290,
      "686668": 291,
      "678662": 292,
      "592178": 293,
      "669911": 294,
      "664040": 295,
      "666624": 296,
      "643376": 297,
      "687597": 298,
      "641857": 299,
      "666139": 300,
      "676356": 301,
      "670764": 302,
      "605361": 303,
      "571657": 304,
      "678554": 305,
      "650490": 306,
      "691406": 307,
      "666018": 308,
      "676609": 309,
      "578428": 310,
      "650559": 311,
      "543877": 312,
      "666134": 313,
      "682177": 314,
      "666023": 315,
      "642350": 316,
      "701305": 317,
      "676801": 318,
      "643289": 319,
      "666152": 320,
      "665966": 321,
      "677649": 322,
      "545341": 323,
      "669398": 324,
      "642136": 325,
      "681460": 326,
      "665155": 327,
      "608671": 328,
      "624641": 329,
      "642708": 330,
      "665561": 331,
      "679032": 332,
      "656180": 333,
      "665019": 334,
      "596142": 335,
      "676914": 336,
      "677008": 337,
      "696100": 338,
      "670224": 339,
      "656248": 340,
      "622569": 341,
      "686554": 342,
      "641555": 343,
      "606992": 344,
      "678225": 345,
      "691594": 346,
      "669261": 347,
      "669707": 348,
      "672275": 349,
      "669477": 350,
      "669289": 351,
      "682641": 352,
      "680118": 353,
      "640902": 354,
      "680474": 355,
      "641658": 356,
      "669194": 357,
      "680716": 358,
      "669357": 359,
      "686780": 360,
      "665839": 361,
      "694362": 362,
      "642851": 363,
      "669087": 364,
      "663968": 365,
      "671289": 366,
      "666163": 367,
      "666160": 368,
      "607732": 369,
      "623168": 370,
      "664702": 371,
      "657656": 372,
      "518595": 373,
      "669234": 374,
      "671286": 375,
      "595978": 376,
      "642201": 377,
      "607067": 378,
      "663609": 379,
      "686475": 380,
      "681508": 381,
      "666397": 382,
      "680577": 383,
      "663853": 384,
      "608701": 385,
      "670156": 386,
      "621035": 387,
      "683766": 388,
      "605170": 389,
      "669743": 390,
      "664913": 391,
      "644433": 392,
      "656413": 393,
      "670032": 394,
      "677588": 395,
      "663584": 396,
      "666185": 397,
      "683002": 398,
      "672744": 399,
      "672724": 400,
      "694374": 401,
      "695336": 402,
      "643565": 403,
      "672279": 404,
      "650968": 405,
      "691728": 406,
      "660757": 407,
      "686527": 408,
      "666165": 409,
      "669221": 410,
      "676439": 411,
      "666181": 412,
      "660844": 413,
      "691907": 414,
      "663796": 415,
      "671221": 416,
      "605204": 417,
      "687957": 418,
      "805367": 419,
      "682657": 420,
      "621512": 421,
      "641943": 422,
      "553882": 423,
      "682622": 424,
      "680779": 425,
      "691182": 426,
      "686797": 427,
      "542963": 428,
      "642180": 429,
      "683083": 430,
      "656582": 431,
      "675659": 432,
      "680718": 433,
      "669720": 434,
      "810938": 435,
      "660821": 436,
      "690924": 437,
      "680700": 438,
      "700337": 439,
      "681393": 440,
      "687263": 441,
      "702332": 442,
      "592696": 443,
      "660644": 444,
      "657077": 445,
      "807712": 446,
      "668845": 447,
      "802415": 448,
      "640492": 449,
      "672359": 450,
      "681584": 451,
      "702358": 452,
      "670276": 453,
      "690291": 454,
      "682927": 455,
      "682663": 456,
      "666915": 457,
      "669200": 458,
      "701762": 459,
      "605113": 460,
      "642215": 461,
      "669717": 462,
      "685301": 463,
      "678489": 464,
      "680911": 465,
      "682626": 466,
      "643446": 467,
      "663662": 468,
      "676701": 469,
      "682729": 470,
      "662139": 471,
      "656896": 472,
      "668974": 473,
      "669392": 474,
      "672569": 475,
      "682997": 476,
      "571466": 477,
      "676480": 478,
      "688760": 479,
      "689041": 480,
      "663886": 481,
      "678391": 482,
      "669134": 483,
      "689172": 484,
      "691723": 485,
      "694359": 486,
      "668942": 487,
      "571912": 488,
      "647351": 489,
      "808975": 490,
      "668904": 491,
      "678894": 492,
      "681546": 493,
      "694497": 494,
      "677956": 495,
      "676551": 496,
      "664059": 497,
      "683090": 498,
      "686765": 499,
      "671284": 500,
      "663897": 501,
      "683021": 502,
      "655316": 503,
      "686823": 504,
      "518934": 505,
      "691783": 506,
      "694208": 507,
      "668731": 508,
      "687221": 509,
      "680837": 510,
      "669256": 511,
      "687462": 512,
      "676812": 513,
      "690987": 514,
      "695734": 515,
      "672016": 516,
      "680769": 517,
      "660670": 518,
      "669722": 519,
      "676724": 520,
      "691785": 521,
      "663837": 522,
      "680862": 523,
      "679845": 524,
      "645305": 525,
      "696030": 526,
      "624512": 527,
      "670231": 528,
      "683748": 529,
      "672761": 530,
      "663967": 531,
      "682183": 532,
      "642731": 533,
      "669450": 534,
      "664068": 535,
      "694376": 536,
      "702284": 537,
      "656541": 538,
      "681715": 539,
      "676466": 540,
      "545121": 541,
      "681807": 542,
      "669374": 543,
      "689200": 544,
      "678009": 545,
      "666464": 546,
      "677595": 547,
      "695506": 548,
      "669288": 549,
      "642086": 550,
      "668800": 551,
      "668723": 552,
      "690022": 553,
      "691019": 554,
      "624513": 555,
      "805249": 556,
      "663330": 557,
      "664954": 558,
      "701350": 559,
      "665953": 560,
      "682515": 561,
      "695681": 562,
      "676116": 563,
      "641302": 564,
      "641645": 565,
      "683770": 566,
      "676679": 567,
      "519317": 568,
      "691781": 569,
      "670092": 570,
      "669369": 571,
      "695257": 572,
      "605244": 573,
      "671083": 574,
      "681987": 575,
      "679822": 576,
      "665877": 577,
      "666211": 578,
      "543510": 579,
      "686452": 580,
      "680737": 581,
      "683004": 582,
      "641856": 583,
      "677870": 584,
      "687515": 585,
      "692585": 586,
      "670097": 587,
      "678011": 588,
      "677942": 589,
      "677060": 590,
      "543592": 591,
      "665923": 592,
      "695657": 593,
      "680869": 594,
      "642727": 595,
      "673490": 596,
      "694388": 597,
      "685744": 598,
      "663536": 599,
      "807799": 600,
      "656577": 601,
      "694728": 602,
      "805373": 603,
      "675915": 604,
      "680728": 605,
      "663368": 606,
      "683227": 607,
      "672012": 608,
      "572138": 609,
      "666126": 610,
      "682653": 611,
      "656484": 612,
      "687231": 613,
      "687859": 614,
      "682988": 615,
      "669236": 616,
      "690976": 617,
      "668885": 618,
      "805300": 619,
      "687529": 620,
      "667452": 621,
      "669326": 622,
      "679631": 623,
      "692216": 624,
      "663731": 625,
      "687551": 626,
      "671976": 627,
      "691720": 628,
      "656185": 629,
      "681909": 630,
      "677941": 631,
      "677592": 632,
      "506702": 633,
      "676044": 634,
      "695391": 635,
      "672642": 636,
      "687637": 637,
      "701675": 638,
      "683357": 639,
      "694212": 640,
      "686894": 641,
      "691185": 642,
      "700246": 643,
      "691373": 644,
      "605353": 645,
      "677943": 646,
      "829272": 647,
      "693409": 648,
      "687478": 649,
      "699625": 650,
      "667690": 651,
      "701398": 652,
      "671655": 653,
      "682868": 654,
      "682634": 655,
      "695600": 656,
      "694377": 657,
      "595751": 658,
      "666150": 659,
      "640459": 660,
      "695670": 661,
      "691011": 662,
      "665861": 663,
      "622268": 664,
      "805904": 665,
      "694203": 666,
      "805811": 667,
      "642020": 668,
      "666198": 669,
      "804668": 670,
      "690984": 671,
      "596117": 672
    },
    "stand": {
      "L": 1,
      "R": 2
    },
    "p_throws": {
      "L": 1,
      "R": 2
    },
    "inning_topbot": {
      "Top": 1,
      "Bot": 2
    },
    "count_state": {
      "0-0": 1,
      "0-1": 2,
      "1-0": 3,
      "2-0": 4,
      "3-0": 5,
      "3-1": 6,
      "1-1": 7,
      "2-1": 8,
      "2-2": 9,
      "3-2": 10,
      "0-2": 11,
      "1-2": 12
    },
    "prev_pitch_type": {
      "START": 1,
      "FF": 2,
      "CU": 3,
      "FS": 4,
      "ST": 5,
      "SI": 6,
      "KC": 7,
      "FC": 8,
      "CH": 9,
      "SL": 10,
      "SV": 11,
      "CS": 12,
      "FA": 13,
      "FO": 14,
      "PO": 15,
      "EP": 16,
      "KN": 17,
      "SC": 18
    },
    "count_situation": {
      "even": 1,
      "ahead": 2,
      "behind": 3
    }
  },
  "y_vocab": {
    "breaking": 1,
    "fastball": 2,
    "offspeed": 3
  },
  "feature_spec": {
    "target": "y_next_pitch_group",
    "cat_cols": [
      "pitcher",
      "batter",
      "stand",
      "p_throws",
      "inning_topbot",
      "count_state",
      "prev_pitch_type",
      "count_situation"
    ],
    "num_cols": [
      "balls",
      "strikes",
      "outs_when_up",
      "inning",
      "bat_score_diff",
      "on_1b",
      "on_2b",
      "on_3b",
      "pitcher_sit_fb_rate",
      "pitcher_sit_br_rate",
      "pitcher_sit_os_rate",
      "pitcher_sit_whiff_rate",
      "batter_sit_swing_rate",
      "batter_sit_whiff_rate"
    ]
  },
  "exported_at": "2026-04-10T22:53:21.270206"
}