{
  "cat_vocabs": {
    "pitcher": {
      "645261": 1,
      "669302": 2,
      "663776": 3,
      "607625": 4,
      "681857": 5,
      "668909": 6,
      "518397": 7,
      "681867": 8,
      "641482": 9,
      "543243": 10,
      "543294": 11,
      "608665": 12,
      "543475": 13,
      "592662": 14,
      "607067": 15,
      "669923": 16,
      "579328": 17,
      "664285": 18,
      "592351": 19,
      "682243": 20,
      "656731": 21,
      "571927": 22,
      "621107": 23,
      "657746": 24,
      "683409": 25,
      "641712": 26,
      "621057": 27,
      "571510": 28,
      "680573": 29,
      "663567": 30,
      "518585": 31,
      "669211": 32,
      "675916": 33,
      "595881": 34,
      "658648": 35,
      "669459": 36,
      "675911": 37,
      "676664": 38,
      "608032": 39,
      "663855": 40,
      "656464": 41,
      "678495": 42,
      "656756": 43,
      "458681": 44,
      "668868": 45,
      "664353": 46,
      "608331": 47,
      "691587": 48,
      "680694": 49,
      "676974": 50,
      "592473": 51,
      "605130": 52,
      "628317": 53,
      "605135": 54,
      "671131": 55,
      "693433": 56,
      "657508": 57,
      "625643": 58,
      "686580": 59,
      "675921": 60,
      "689017": 61,
      "680885": 62,
      "621366": 63,
      "641154": 64,
      "543135": 65,
      "669194": 66,
      "656605": 67,
      "663738": 68,
      "671106": 69,
      "605400": 70,
      "681911": 71,
      "663903": 72,
      "695076": 73,
      "676596": 74,
      "689266": 75,
      "681190": 76,
      "571479": 77,
      "669022": 78,
      "656427": 79,
      "621244": 80,
      "664299": 81,
      "656557": 82,
      "675627": 83,
      "805673": 84,
      "500779": 85,
      "641771": 86,
      "502624": 87,
      "672282": 88,
      "608337": 89,
      "669461": 90,
      "686973": 91,
      "453286": 92,
      "671737": 93,
      "663941": 94,
      "657053": 95,
      "672578": 96,
      "682610": 97,
      "657044": 98,
      "573186": 99,
      "608717": 100,
      "656271": 101,
      "650496": 102,
      "605280": 103,
      "671096": 104,
      "669456": 105,
      "656302": 106,
      "493603": 107,
      "596001": 108,
      "605177": 109,
      "671922": 110,
      "450203": 111,
      "678226": 112,
      "518876": 113,
      "661563": 114,
      "543859": 115,
      "621389": 116,
      "663432": 117,
      "663574": 118,
      "607179": 119,
      "666277": 120,
      "663623": 121,
      "542881": 122,
      "650633": 123,
      "656222": 124,
      "592791": 125,
      "694813": 126,
      "622251": 127,
      "623433": 128,
      "680570": 129,
      "605397": 130,
      "695243": 131,
      "628711": 132,
      "641927": 133,
      "668678": 134,
      "683003": 135,
      "687330": 136,
      "657024": 137,
      "594902": 138,
      "657006": 139,
      "641755": 140,
      "689672": 141,
      "641540": 142,
      "663765": 143,
      "657097": 144,
      "656849": 145,
      "502043": 146,
      "571760": 147,
      "592767": 148,
      "665871": 149,
      "622491": 150,
      "670174": 151,
      "641729": 152,
      "571946": 153,
      "676106": 154,
      "605447": 155,
      "686539": 156,
      "518617": 157,
      "642216": 158,
      "669276": 159,
      "663485": 160,
      "592773": 161,
      "664854": 162,
      "571578": 163,
      "519242": 164,
      "570632": 165,
      "592866": 166,
      "571656": 167,
      "608718": 168,
      "657376": 169,
      "594835": 170,
      "640470": 171,
      "686654": 172,
      "686747": 173,
      "656550": 174,
      "605483": 175,
      "613534": 176,
      "614179": 177,
      "680704": 178,
      "656234": 179,
      "686752": 180,
      "664062": 181,
      "650671": 182,
      "666142": 183,
      "700249": 184,
      "548389": 185,
      "622772": 186,
      "674072": 187,
      "663372": 188,
      "571945": 189,
      "554430": 190,
      "664139": 191,
      "678368": 192,
      "679525": 193,
      "676130": 194,
      "666157": 195,
      "686730": 196,
      "669711": 197,
      "623451": 198,
      "607481": 199,
      "544150": 200,
      "676440": 201,
      "677865": 202,
      "605288": 203,
      "605154": 204,
      "592332": 205,
      "571670": 206,
      "641329": 207,
      "476595": 208,
      "592426": 209,
      "692230": 210,
      "660261": 211,
      "673513": 212,
      "543339": 213,
      "523260": 214,
      "621363": 215,
      "607259": 216,
      "690986": 217,
      "477132": 218,
      "680730": 219,
      "607074": 220,
      "656786": 221,
      "673540": 222,
      "661403": 223,
      "601713": 224,
      "642232": 225,
      "681676": 226,
      "472551": 227,
      "669424": 228,
      "664875": 229,
      "650893": 230,
      "673929": 231,
      "686613": 232,
      "657240": 233,
      "607200": 234,
      "682120": 235,
      "808967": 236,
      "642397": 237,
      "665152": 238,
      "681293": 239,
      "650911": 240,
      "502171": 241,
      "593974": 242,
      "592836": 243,
      "622503": 244,
      "666200": 245,
      "607455": 246,
      "677960": 247,
      "656232": 248,
      "641793": 249,
      "668933": 250,
      "669854": 251,
      "701643": 252,
      "669684": 253,
      "696136": 254,
      "666720": 255,
      "622554": 256,
      "624522": 257,
      "643410": 258,
      "623352": 259,
      "595014": 260,
      "656970": 261,
      "622786": 262,
      "678394": 263,
      "683155": 264,
      "622663": 265,
      "489446": 266,
      "670950": 267,
      "615698": 268,
      "669947": 269,
      "448179": 270,
      "677053": 271,
      "606149": 272,
      "680723": 273,
      "669674": 274,
      "628452": 275,
      "506433": 276,
      "668754": 277,
      "641726": 278,
      "519043": 279,
      "547973": 280,
      "680735": 281,
      "657265": 282,
      "624133": 283,
      "543101": 284,
      "552640": 285,
      "663978": 286,
      "593958": 287,
      "621051": 288,
      "600986": 289,
      "694363": 290,
      "666214": 291,
      "621295": 292,
      "594577": 293,
      "656578": 294,
      "663992": 295,
      "640462": 296,
      "668968": 297,
      "527048": 298,
      "657277": 299,
      "641871": 300,
      "543521": 301,
      "676254": 302,
      "702352": 303,
      "676710": 304,
      "676534": 305,
      "643377": 306,
      "666205": 307,
      "605488": 308,
      "669422": 309,
      "621345": 310,
      "669062": 311,
      "670124": 312,
      "686610": 313,
      "674003": 314,
      "669093": 315,
      "543901": 316,
      "686826": 317,
      "542888": 318,
      "666721": 319,
      "672456": 320,
      "608344": 321,
      "600921": 322,
      "425794": 323,
      "642207": 324,
      "666818": 325,
      "519151": 326,
      "676775": 327,
      "608371": 328,
      "683004": 329,
      "592454": 330,
      "663554": 331,
      "667755": 332,
      "641401": 333,
      "641627": 334,
      "607644": 335,
      "663704": 336,
      "572143": 337,
      "656641": 338,
      "656288": 339,
      "543272": 340,
      "663559": 341,
      "656629": 342,
      "678606": 343,
      "554340": 344,
      "642545": 345,
      "471911": 346,
      "518516": 347,
      "687792": 348,
      "608379": 349,
      "642547": 350,
      "679885": 351,
      "598264": 352,
      "592741": 353,
      "643511": 354,
      "622694": 355,
      "527054": 356,
      "605242": 357,
      "621112": 358,
      "622098": 359,
      "665795": 360,
      "680744": 361,
      "701581": 362,
      "681035": 363,
      "656061": 364,
      "663158": 365,
      "663546": 366,
      "662253": 367,
      "605513": 368,
      "592094": 369,
      "681892": 370,
      "596295": 371,
      "670167": 372,
      "650644": 373,
      "643338": 374,
      "682847": 375,
      "666159": 376,
      "595345": 377,
      "663556": 378,
      "666204": 379,
      "572020": 380,
      "670766": 381,
      "488984": 382,
      "434378": 383,
      "455119": 384,
      "669438": 385,
      "669203": 386,
      "694297": 387,
      "647336": 388,
      "623167": 389,
      "676684": 390,
      "686651": 391,
      "694973": 392,
      "607192": 393,
      "680767": 394,
      "650556": 395,
      "682227": 396,
      "701542": 397,
      "656529": 398,
      "623149": 399,
      "641745": 400,
      "547001": 401,
      "592826": 402,
      "640455": 403,
      "606160": 404,
      "640451": 405,
      "547179": 406,
      "445276": 407,
      "666201": 408,
      "663436": 409,
      "624647": 410,
      "572955": 411,
      "674444": 412,
      "605463": 413,
      "666168": 414,
      "676617": 415,
      "621111": 416,
      "664126": 417,
      "592789": 418,
      "446372": 419,
      "642834": 420,
      "642048": 421,
      "541640": 422,
      "621381": 423,
      "663531": 424,
      "519326": 425,
      "687911": 426,
      "676272": 427,
      "669724": 428,
      "543037": 429,
      "543507": 430,
      "668964": 431,
      "681402": 432,
      "680897": 433,
      "664849": 434,
      "686799": 435,
      "687863": 436,
      "663989": 437,
      "668390": 438,
      "595928": 439,
      "669467": 440,
      "600917": 441,
      "572403": 442,
      "657571": 443,
      "543351": 444,
      "664076": 445,
      "642100": 446,
      "800049": 447,
      "666745": 448,
      "676105": 449,
      "670059": 450,
      "669620": 451,
      "685801": 452,
      "668881": 453,
      "672335": 454,
      "686218": 455,
      "548384": 456,
      "684007": 457,
      "681517": 458,
      "641585": 459,
      "593576": 460,
      "642585": 461,
      "573204": 462,
      "660853": 463,
      "668338": 464,
      "472610": 465,
      "668941": 466,
      "670955": 467,
      "622075": 468,
      "647315": 469,
      "675540": 470,
      "700270": 471,
      "676979": 472,
      "681799": 473,
      "656412": 474,
      "596133": 475,
      "679156": 476,
      "660761": 477,
      "685107": 478,
      "669330": 479,
      "542585": 480,
      "666808": 481,
      "677020": 482,
      "681869": 483,
      "669432": 484,
      "676760": 485,
      "641302": 486,
      "664776": 487,
      "676395": 488,
      "656945": 489,
      "663474": 490,
      "502085": 491,
      "676282": 492,
      "669796": 493,
      "607536": 494,
      "680742": 495,
      "676879": 496,
      "686563": 497,
      "666129": 498,
      "656353": 499,
      "682990": 500,
      "606930": 501,
      "596057": 502,
      "641360": 503,
      "573009": 504,
      "621199": 505,
      "676714": 506,
      "593423": 507,
      "676265": 508,
      "686796": 509,
      "681432": 510,
      "621294": 511,
      "621076": 512,
      "542947": 513,
      "687922": 514,
      "657424": 515,
      "641941": 516,
      "669373": 517,
      "668873": 518,
      "664192": 519,
      "663947": 520,
      "657140": 521,
      "683769": 522,
      "665625": 523,
      "621237": 524,
      "642701": 525,
      "685299": 526,
      "691441": 527,
      "667463": 528,
      "680686": 529,
      "694037": 530,
      "593334": 531,
      "622250": 532,
      "543518": 533,
      "489119": 534,
      "592229": 535,
      "621016": 536,
      "665622": 537,
      "660825": 538,
      "671111": 539,
      "670912": 540,
      "623437": 541,
      "676702": 542,
      "621383": 543,
      "669060": 544,
      "670990": 545,
      "666374": 546,
      "670970": 547,
      "687830": 548,
      "547943": 549,
      "663658": 550,
      "608723": 551,
      "670280": 552,
      "660906": 553,
      "643361": 554,
      "672710": 555,
      "605347": 556,
      "663423": 557,
      "661527": 558,
      "661309": 559,
      "678906": 560,
      "571948": 561,
      "663773": 562,
      "681806": 563,
      "664199": 564,
      "660271": 565,
      "656848": 566,
      "680739": 567,
      "683627": 568,
      "660813": 569,
      "621242": 570,
      "640448": 571,
      "608648": 572,
      "657612": 573,
      "594580": 574,
      "663893": 575,
      "687765": 576,
      "605182": 577,
      "689958": 578,
      "608334": 579,
      "650960": 580,
      "630023": 581,
      "425844": 582,
      "674944": 583,
      "676206": 584,
      "664948": 585,
      "518886": 586,
      "621114": 587,
      "623381": 588,
      "622072": 589,
      "641656": 590,
      "621368": 591,
      "687798": 592,
      "669713": 593,
      "656730": 594,
      "605200": 595,
      "628708": 596,
      "641835": 597,
      "571901": 598,
      "650895": 599,
      "680736": 600,
      "594798": 601,
      "676477": 602,
      "663460": 603,
      "663687": 604,
      "661383": 605,
      "656457": 606,
      "661440": 607,
      "608678": 608,
      "693821": 609,
      "665734": 610,
      "657585": 611,
      "543056": 612,
      "671305": 613,
      "657514": 614,
      "671212": 615,
      "692285": 616,
      "661395": 617,
      "669622": 618,
      "445926": 619,
      "682010": 620,
      "672730": 621,
      "642546": 622,
      "641312": 623,
      "656546": 624,
      "664747": 625,
      "676680": 626,
      "669387": 627,
      "669212": 628,
      "596112": 629,
      "621097": 630,
      "669169": 631,
      "683232": 632,
      "643493": 633,
      "666619": 634,
      "686753": 635,
      "571882": 636,
      "668674": 637,
      "664208": 638,
      "605218": 639,
      "669395": 640,
      "684320": 641,
      "607755": 642,
      "621249": 643,
      "608638": 644,
      "622065": 645,
      "663462": 646,
      "660593": 647,
      "572193": 648,
      "666974": 649,
      "519008": 650,
      "456501": 651,
      "642520": 652,
      "681882": 653,
      "669160": 654,
      "573124": 655,
      "519293": 656,
      "458677": 657,
      "676092": 658,
      "605121": 659,
      "670241": 660,
      "688297": 661,
      "672391": 662,
      "642758": 663,
      "605452": 664,
      "677976": 665,
      "665048": 666,
      "682175": 667,
      "543766": 668,
      "656794": 669,
      "656638": 670,
      "670871": 671,
      "696131": 672,
      "641420": 673,
      "671345": 674,
      "608566": 675,
      "687014": 676,
      "621053": 677,
      "456713": 678,
      "598286": 679,
      "661269": 680,
      "690829": 681,
      "641778": 682,
      "623474": 683,
      "664294": 684,
      "592288": 685,
      "664351": 686,
      "663752": 687,
      "663362": 688,
      "663568": 689,
      "623465": 690,
      "641582": 691,
      "572971": 692,
      "622259": 693,
      "657756": 694,
      "571863": 695,
      "670102": 696,
      "806185": 697,
      "689981": 698,
      "686642": 699,
      "665001": 700,
      "663542": 701,
      "663878": 702,
      "666364": 703,
      "689225": 704,
      "689147": 705,
      "663465": 706,
      "688107": 707,
      "528748": 708,
      "592527": 709,
      "641703": 710,
      "669721": 711,
      "672582": 712,
      "656257": 713,
      "620982": 714,
      "502179": 715,
      "683175": 716,
      "606965": 717,
      "682967": 718,
      "665896": 719,
      "663804": 720,
      "669358": 721,
      "677161": 722,
      "669952": 723,
      "641743": 724,
      "668665": 725,
      "655889": 726,
      "593619": 727,
      "592779": 728,
      "685410": 729,
      "675989": 730,
      "612434": 731,
      "686294": 732,
      "656924": 733,
      "660600": 734,
      "682989": 735,
      "677944": 736,
      "664350": 737,
      "687396": 738,
      "518489": 739,
      "641816": 740,
      "687134": 741,
      "622569": 742,
      "691951": 743,
      "657649": 744,
      "642770": 745,
      "669111": 746,
      "656876": 747,
      "571539": 748,
      "678821": 749,
      "681982": 750,
      "663321": 751,
      "664942": 752,
      "547184": 753,
      "674370": 754,
      "592155": 755,
      "669912": 756,
      "682052": 757,
      "663969": 758,
      "669084": 759,
      "643256": 760,
      "672860": 761,
      "680689": 762,
      "669145": 763,
      "605156": 764,
      "676614": 765,
      "694738": 766,
      "659275": 767,
      "676962": 768,
      "622608": 769,
      "642528": 770,
      "680880": 771,
      "570257": 772,
      "656382": 773,
      "669270": 774,
      "664129": 775,
      "667297": 776,
      "690544": 777,
      "592254": 778,
      "676661": 779,
      "678061": 780,
      "676568": 781,
      "700363": 782,
      "656887": 783,
      "660896": 784,
      "570666": 785,
      "668970": 786,
      "640444": 787,
      "656458": 788,
      "642239": 789,
      "690925": 790,
      "663558": 791,
      "676428": 792,
      "663562": 793,
      "670046": 794,
      "623211": 795,
      "702674": 796,
      "672851": 797,
      "668676": 798,
      "543391": 799,
      "543548": 800,
      "687362": 801,
      "700241": 802,
      "641672": 803,
      "502202": 804,
      "674285": 805,
      "681217": 806,
      "678692": 807,
      "607359": 808,
      "622780": 809,
      "657697": 810,
      "453268": 811,
      "646242": 812,
      "680732": 813,
      "687145": 814,
      "642231": 815,
      "607237": 816,
      "672715": 817,
      "657031": 818,
      "682842": 819,
      "691172": 820,
      "605540": 821,
      "622088": 822,
      "607457": 823,
      "683618": 824,
      "674681": 825,
      "689690": 826,
      "677651": 827,
      "605498": 828,
      "694361": 829,
      "687424": 830,
      "670036": 831,
      "677958": 832,
      "665620": 833,
      "594943": 834,
      "666154": 835,
      "621074": 836,
      "666207": 837,
      "668943": 838,
      "656322": 839,
      "694646": 840,
      "656240": 841,
      "696147": 842,
      "668984": 843,
      "670329": 844,
      "700669": 845,
      "642121": 846,
      "676050": 847,
      "621139": 848,
      "693312": 849,
      "592346": 850,
      "669618": 851,
      "656981": 852,
      "665665": 853,
      "663986": 854,
      "593833": 855,
      "606303": 856,
      "622253": 857,
      "656814": 858,
      "669165": 859,
      "690916": 860,
      "670161": 861,
      "689167": 862,
      "682051": 863,
      "686839": 864,
      "595897": 865,
      "669372": 866,
      "664028": 867,
      "608328": 868,
      "595411": 869,
      "668942": 870,
      "687888": 871,
      "670219": 872,
      "670810": 873,
      "605155": 874,
      "676755": 875,
      "685314": 876,
      "622103": 877,
      "676083": 878,
      "672782": 879,
      "683822": 880,
      "814005": 881,
      "663753": 882,
      "642629": 883,
      "671109": 884,
      "656420": 885,
      "543238": 886,
      "677955": 887,
      "683068": 888,
      "656354": 889,
      "641427": 890,
      "656266": 891,
      "543063": 892,
      "670103": 893,
      "657272": 894,
      "453178": 895,
      "668874": 896,
      "676604": 897,
      "675650": 898,
      "687924": 899,
      "660787": 900,
      "683568": 901,
      "685116": 902,
      "681870": 903,
      "656793": 904,
      "622766": 905,
      "656657": 906,
      "592848": 907,
      "656818": 908,
      "680891": 909,
      "656290": 910,
      "542914": 911,
      "544727": 912,
      "680572": 913,
      "669199": 914,
      "667725": 915,
      "669308": 916,
      "672552": 917,
      "663385": 918,
      "596271": 919,
      "521230": 920,
      "681810": 921,
      "663455": 922,
      "605151": 923,
      "667427": 924,
      "663767": 925,
      "542882": 926,
      "607732": 927,
      "607968": 928,
      "678020": 929,
      "611093": 930,
      "676508": 931,
      "680983": 932,
      "681066": 933,
      "673380": 934,
      "686842": 935,
      "554431": 936,
      "694462": 937,
      "605441": 938,
      "607216": 939,
      "641149": 940,
      "621399": 941,
      "666171": 942,
      "672841": 943,
      "700187": 944,
      "687847": 945,
      "596082": 946,
      "571710": 947,
      "642016": 948,
      "669391": 949,
      "682171": 950,
      "666215": 951,
      "686751": 952,
      "673111": 953,
      "571616": 954,
      "656896": 955,
      "543594": 956,
      "702795": 957,
      "681871": 958,
      "682254": 959,
      "605446": 960,
      "676969": 961,
      "673858": 962,
      "656671": 963,
      "664079": 964,
      "657248": 965,
      "688427": 966,
      "679346": 967,
      "676961": 968,
      "685126": 969,
      "668834": 970,
      "502083": 971,
      "656986": 972,
      "656820": 973,
      "666208": 974,
      "642028": 975,
      "640454": 976,
      "571527": 977,
      "663629": 978,
      "681347": 979,
      "621219": 980,
      "622110": 981,
      "629498": 982,
      "607188": 983,
      "605335": 984,
      "670183": 985,
      "687377": 986,
      "664202": 987,
      "517008": 988,
      "679358": 989,
      "642578": 990,
      "656716": 991,
      "606625": 992,
      "660730": 993,
      "592390": 994,
      "669105": 995,
      "641447": 996,
      "676689": 997,
      "656186": 998,
      "683021": 999,
      "572888": 1000,
      "695549": 1001,
      "703231": 1002,
      "657093": 1003,
      "664123": 1004,
      "660431": 1005,
      "686972": 1006,
      "620454": 1007,
      "694350": 1008,
      "646241": 1009,
      "680232": 1010,
      "681808": 1011,
      "593934": 1012,
      "686790": 1013,
      "660644": 1014,
      "677076": 1015,
      "676632": 1016,
      "518626": 1017,
      "676475": 1018,
      "664744": 1019,
      "691094": 1020,
      "686993": 1021,
      "681987": 1022,
      "571771": 1023,
      "570731": 1024,
      "657193": 1025,
      "663971": 1026,
      "657041": 1027,
      "641658": 1028,
      "668470": 1029,
      "679845": 1030,
      "682073": 1031,
      "592222": 1032,
      "641343": 1033,
      "667478": 1034,
      "670097": 1035,
      "676701": 1036,
      "596117": 1037,
      "545121": 1038,
      "666163": 1039,
      "645801": 1040
    },
    "batter": {
      "673490": 1,
      "680869": 2,
      "678554": 3,
      "665155": 4,
      "641343": 5,
      "608369": 6,
      "602104": 7,
      "502671": 8,
      "680474": 9,
      "664761": 10,
      "687401": 11,
      "682626": 12,
      "681481": 13,
      "592663": 14,
      "643217": 15,
      "605361": 16,
      "665750": 17,
      "663457": 18,
      "592450": 19,
      "660271": 20,
      "664913": 21,
      "542208": 22,
      "671277": 23,
      "607680": 24,
      "663837": 25,
      "686676": 26,
      "500743": 27,
      "571657": 28,
      "622534": 29,
      "642715": 30,
      "543309": 31,
      "664774": 32,
      "622110": 33,
      "592626": 34,
      "686527": 35,
      "675656": 36,
      "527038": 37,
      "669016": 38,
      "671739": 39,
      "673237": 40,
      "663698": 41,
      "669394": 42,
      "650489": 43,
      "624413": 44,
      "571912": 45,
      "673357": 46,
      "518692": 47,
      "650859": 48,
      "592192": 49,
      "596019": 50,
      "657041": 51,
      "682928": 52,
      "592518": 53,
      "663609": 54,
      "663656": 55,
      "650391": 56,
      "668723": 57,
      "666464": 58,
      "664057": 59,
      "650402": 60,
      "656716": 61,
      "672695": 62,
      "608385": 63,
      "621020": 64,
      "657077": 65,
      "691023": 66,
      "686823": 67,
      "571970": 68,
      "666181": 69,
      "519317": 70,
      "543807": 71,
      "624585": 72,
      "808982": 73,
      "668939": 74,
      "661388": 75,
      "608324": 76,
      "547180": 77,
      "656941": 78,
      "676369": 79,
      "660821": 80,
      "592178": 81,
      "665923": 82,
      "518792": 83,
      "657757": 84,
      "607043": 85,
      "457759": 86,
      "519058": 87,
      "680776": 88,
      "668715": 89,
      "643289": 90,
      "668472": 91,
      "641432": 92,
      "672820": 93,
      "641355": 94,
      "607208": 95,
      "680977": 96,
      "608336": 97,
      "545361": 98,
      "600869": 99,
      "665019": 100,
      "676116": 101,
      "656775": 102,
      "663993": 103,
      "518595": 104,
      "607732": 105,
      "621438": 106,
      "543592": 107,
      "605204": 108,
      "672515": 109,
      "666185": 110,
      "670242": 111,
      "676059": 112,
      "665839": 113,
      "521692": 114,
      "663368": 115,
      "681082": 116,
      "595777": 117,
      "683734": 118,
      "667452": 119,
      "669242": 120,
      "624512": 121,
      "622761": 122,
      "687462": 123,
      "621566": 124,
      "594777": 125,
      "605141": 126,
      "660707": 127,
      "676694": 128,
      "677551": 129,
      "677800": 130,
      "670541": 131,
      "668227": 132,
      "700932": 133,
      "665742": 134,
      "672284": 135,
      "663611": 136,
      "669003": 137,
      "650490": 138,
      "663697": 139,
      "691026": 140,
      "665966": 141,
      "676609": 142,
      "669004": 143,
      "606192": 144,
      "663527": 145,
      "455117": 146,
      "573262": 147,
      "571745": 148,
      "502054": 149,
      "593428": 150,
      "663624": 151,
      "664023": 152,
      "667670": 153,
      "673962": 154,
      "660620": 155,
      "663898": 156,
      "676391": 157,
      "571771": 158,
      "669304": 159,
      "668804": 160,
      "641598": 161,
      "678225": 162,
      "682622": 163,
      "681807": 164,
      "691594": 165,
      "621550": 166,
      "670623": 167,
      "672580": 168,
      "642086": 169,
      "543068": 170,
      "666971": 171,
      "664983": 172,
      "545121": 173,
      "668901": 174,
      "669257": 175,
      "681624": 176,
      "672275": 177,
      "679529": 178,
      "672640": 179,
      "645305": 180,
      "676946": 181,
      "657557": 182,
      "664728": 183,
      "606466": 184,
      "592669": 185,
      "664034": 186,
      "641857": 187,
      "670224": 188,
      "660688": 189,
      "693304": 190,
      "663538": 191,
      "682868": 192,
      "642336": 193,
      "696285": 194,
      "650559": 195,
      "670764": 196,
      "665489": 197,
      "686217": 198,
      "658668": 199,
      "676801": 200,
      "686797": 201,
      "671289": 202,
      "671213": 203,
      "595909": 204,
      "672724": 205,
      "668952": 206,
      "543257": 207,
      "669357": 208,
      "694671": 209,
      "623993": 210,
      "553993": 211,
      "514888": 212,
      "677588": 213,
      "621493": 214,
      "680777": 215,
      "690993": 216,
      "656896": 217,
      "621439": 218,
      "571448": 219,
      "807799": 220,
      "682729": 221,
      "624503": 222,
      "607461": 223,
      "668800": 224,
      "669127": 225,
      "542303": 226,
      "694377": 227,
      "677951": 228,
      "543939": 229,
      "656555": 230,
      "543510": 231,
      "645801": 232,
      "683011": 233,
      "622569": 234,
      "665877": 235,
      "607054": 236,
      "621043": 237,
      "678662": 238,
      "624641": 239,
      "694384": 240,
      "656305": 241,
      "668832": 242,
      "687952": 243,
      "664040": 244,
      "663728": 245,
      "663853": 246,
      "624424": 247,
      "665862": 248,
      "572233": 249,
      "606115": 250,
      "680757": 251,
      "608841": 252,
      "605137": 253,
      "516782": 254,
      "605119": 255,
      "683002": 256,
      "630105": 257,
      "593643": 258,
      "656413": 259,
      "605170": 260,
      "687363": 261,
      "669707": 262,
      "662139": 263,
      "686894": 264,
      "695578": 265,
      "543877": 266,
      "678877": 267,
      "680779": 268,
      "681393": 269,
      "660670": 270,
      "542364": 271,
      "643396": 272,
      "670770": 273,
      "643565": 274,
      "663616": 275,
      "462101": 276,
      "640492": 277,
      "672386": 278,
      "677649": 279,
      "596115": 280,
      "696100": 281,
      "641943": 282,
      "669224": 283,
      "669720": 284,
      "646240": 285,
      "701538": 286,
      "493329": 287,
      "467793": 288,
      "656448": 289,
      "458015": 290,
      "543281": 291,
      "673548": 292,
      "680700": 293,
      "643446": 294,
      "663743": 295,
      "666397": 296,
      "621563": 297,
      "666158": 298,
      "668930": 299,
      "596129": 300,
      "641313": 301,
      "572191": 302,
      "608070": 303,
      "669743": 304,
      "592206": 305,
      "592656": 306,
      "681297": 307,
      "666624": 308,
      "669911": 309,
      "572761": 310,
      "502110": 311,
      "677594": 312,
      "669392": 313,
      "664314": 314,
      "575929": 315,
      "656582": 316,
      "446334": 317,
      "666135": 318,
      "645277": 319,
      "669261": 320,
      "643376": 321,
      "670032": 322,
      "642731": 323,
      "650333": 324,
      "679845": 325,
      "642708": 326,
      "593160": 327,
      "594807": 328,
      "682848": 329,
      "457705": 330,
      "668731": 331,
      "668942": 332,
      "621028": 333,
      "592200": 334,
      "691718": 335,
      "663586": 336,
      "670097": 337,
      "572138": 338,
      "543760": 339,
      "664702": 340,
      "672761": 341,
      "665487": 342,
      "678882": 343,
      "656811": 344,
      "543063": 345,
      "596117": 346,
      "665161": 347,
      "679032": 348,
      "666150": 349,
      "669221": 350,
      "681351": 351,
      "623912": 352,
      "641933": 353,
      "671083": 354,
      "666182": 355,
      "676914": 356,
      "668709": 357,
      "687263": 358,
      "666139": 359,
      "665804": 360,
      "645302": 361,
      "671221": 362,
      "519203": 363,
      "500871": 364,
      "606132": 365,
      "686469": 366,
      "641505": 367,
      "518934": 368,
      "666310": 369,
      "592885": 370,
      "666149": 371,
      "676475": 372,
      "647304": 373,
      "677942": 374,
      "543685": 375,
      "664056": 376,
      "642350": 377,
      "677595": 378,
      "672356": 379,
      "668670": 380,
      "690291": 381,
      "689172": 382,
      "655316": 383,
      "595281": 384,
      "664238": 385,
      "683737": 386,
      "608348": 387,
      "665926": 388,
      "596142": 389,
      "553869": 390,
      "624428": 391,
      "670223": 392,
      "666969": 393,
      "656180": 394,
      "641487": 395,
      "620443": 396,
      "608671": 397,
      "657656": 398,
      "687799": 399,
      "691011": 400,
      "666152": 401,
      "671732": 402,
      "542932": 403,
      "666160": 404,
      "677587": 405,
      "592273": 406,
      "694192": 407,
      "641786": 408,
      "444482": 409,
      "660162": 410,
      "683146": 411,
      "641645": 412,
      "593871": 413,
      "669397": 414,
      "676070": 415,
      "666906": 416,
      "660644": 417,
      "628451": 418,
      "676701": 419,
      "643393": 420,
      "700242": 421,
      "664058": 422,
      "669701": 423,
      "656541": 424,
      "656537": 425,
      "596146": 426,
      "453568": 427,
      "664874": 428,
      "680118": 429,
      "693307": 430,
      "624431": 431,
      "572816": 432,
      "682177": 433,
      "681146": 434,
      "663647": 435,
      "545341": 436,
      "687529": 437,
      "666165": 438,
      "680574": 439,
      "571875": 440,
      "593934": 441,
      "678246": 442,
      "665506": 443,
      "660766": 444,
      "686668": 445,
      "677956": 446,
      "656495": 447,
      "644374": 448,
      "663886": 449,
      "663662": 450,
      "682668": 451,
      "669477": 452,
      "686780": 453,
      "679631": 454,
      "456781": 455,
      "678894": 456,
      "670042": 457,
      "665833": 458,
      "605113": 459,
      "641658": 460,
      "614177": 461,
      "691016": 462,
      "676480": 463,
      "621035": 464,
      "543333": 465,
      "700250": 466,
      "642180": 467,
      "621512": 468,
      "570482": 469,
      "666163": 470,
      "605612": 471,
      "606992": 472,
      "677950": 473,
      "663757": 474,
      "665120": 475,
      "682829": 476,
      "595879": 477,
      "641680": 478,
      "543543": 479,
      "666176": 480,
      "623520": 481,
      "680911": 482,
      "641584": 483,
      "666915": 484,
      "608701": 485,
      "691406": 486,
      "642136": 487,
      "624415": 488,
      "547989": 489,
      "592325": 490,
      "664954": 491,
      "678009": 492,
      "669222": 493,
      "669289": 494,
      "676356": 495,
      "474832": 496,
      "671056": 497,
      "687093": 498,
      "665953": 499,
      "614173": 500,
      "666018": 501,
      "643265": 502,
      "669364": 503,
      "671286": 504,
      "443558": 505,
      "681584": 506,
      "641820": 507,
      "657136": 508,
      "686759": 509,
      "666134": 510,
      "682617": 511,
      "682985": 512,
      "682998": 513,
      "543305": 514,
      "660844": 515,
      "642215": 516,
      "642133": 517,
      "681546": 518,
      "679881": 519,
      "678489": 520,
      "686681": 521,
      "516416": 522,
      "682073": 523,
      "596103": 524,
      "694497": 525,
      "595751": 526,
      "669134": 527,
      "642197": 528,
      "621466": 529,
      "665828": 530,
      "661531": 531,
      "488726": 532,
      "805779": 533,
      "668751": 534,
      "649557": 535,
      "672569": 536,
      "621545": 537,
      "656248": 538,
      "663845": 539,
      "669369": 540,
      "672779": 541,
      "518735": 542,
      "682988": 543,
      "572204": 544,
      "682641": 545,
      "672012": 546,
      "641856": 547,
      "693049": 548,
      "668843": 549,
      "647351": 550,
      "687597": 551,
      "669200": 552,
      "666023": 553,
      "542583": 554,
      "656308": 555,
      "649966": 556,
      "672478": 557,
      "686554": 558,
      "691182": 559,
      "595978": 560,
      "680718": 561,
      "688363": 562,
      "664901": 563,
      "668904": 564,
      "640449": 565,
      "592348": 566,
      "542194": 567,
      "656976": 568,
      "677008": 569,
      "543228": 570,
      "501659": 571,
      "596847": 572,
      "691723": 573,
      "669087": 574,
      "592696": 575,
      "677870": 576,
      "656669": 577,
      "686611": 578,
      "598265": 579,
      "602074": 580,
      "578428": 581,
      "669234": 582,
      "608596": 583,
      "609280": 584,
      "670712": 585,
      "408234": 586,
      "645444": 587,
      "621458": 588,
      "691783": 589,
      "675961": 590,
      "600301": 591,
      "665052": 592,
      "642851": 593,
      "669065": 594,
      "683021": 595,
      "553882": 596,
      "666703": 597,
      "694376": 598,
      "676632": 599,
      "596059": 600,
      "641511": 601,
      "673995": 602,
      "670156": 603,
      "660757": 604,
      "541645": 605,
      "664770": 606,
      "677347": 607,
      "668885": 608,
      "667472": 609,
      "642201": 610,
      "686452": 611,
      "672279": 612,
      "680728": 613,
      "572041": 614,
      "545350": 615,
      "663550": 616,
      "666211": 617,
      "674441": 618,
      "621311": 619,
      "671218": 620,
      "668853": 621,
      "573131": 622,
      "670092": 623,
      "682657": 624,
      "686765": 625,
      "694359": 626,
      "657061": 627,
      "694388": 628,
      "595956": 629,
      "623205": 630,
      "622666": 631,
      "681508": 632,
      "681987": 633,
      "660634": 634,
      "686482": 635,
      "656371": 636,
      "663967": 637,
      "665561": 638,
      "666801": 639,
      "666198": 640,
      "570731": 641,
      "677592": 642,
      "678545": 643,
      "676572": 644,
      "681962": 645,
      "642020": 646,
      "640457": 647,
      "679822": 648,
      "656024": 649,
      "624414": 650,
      "686531": 651,
      "663330": 652,
      "702616": 653,
      "642137": 654,
      "656577": 655,
      "666197": 656,
      "641796": 657,
      "695391": 658,
      "650907": 659,
      "572008": 660,
      "501303": 661,
      "664059": 662,
      "664029": 663,
      "676113": 664,
      "595453": 665,
      "668845": 666,
      "683083": 667,
      "657088": 668,
      "669374": 669,
      "663796": 670,
      "605244": 671,
      "687231": 672,
      "641531": 673,
      "691176": 674,
      "682515": 675,
      "656484": 676,
      "695238": 677,
      "621433": 678,
      "663905": 679,
      "702358": 680,
      "695257": 681,
      "669742": 682,
      "605131": 683,
      "685133": 684,
      "676439": 685,
      "572287": 686,
      "518626": 687,
      "605346": 688,
      "623168": 689,
      "669450": 690,
      "444489": 691,
      "613564": 692,
      "571466": 693,
      "605242": 694,
      "669352": 695,
      "676724": 696,
      "644433": 697,
      "571976": 698,
      "669137": 699,
      "665782": 700,
      "506702": 701,
      "677941": 702,
      "694175": 703,
      "641525": 704,
      "669208": 705,
      "672642": 706,
      "572228": 707,
      "671117": 708,
      "656403": 709,
      "605421": 710,
      "669326": 711,
      "680814": 712,
      "640902": 713,
      "672744": 714,
      "663630": 715,
      "666164": 716,
      "694362": 717,
      "623507": 718,
      "681460": 719,
      "656883": 720,
      "805373": 721,
      "641779": 722,
      "664247": 723,
      "660758": 724,
      "680418": 725,
      "680716": 726,
      "682119": 727,
      "701305": 728,
      "687957": 729,
      "686555": 730,
      "669699": 731,
      "663897": 732,
      "675986": 733,
      "695336": 734,
      "670276": 735,
      "657193": 736,
      "680577": 737,
      "621532": 738,
      "600303": 739,
      "641470": 740,
      "571980": 741,
      "669023": 742,
      "543482": 743,
      "578570": 744,
      "547379": 745,
      "676896": 746,
      "672701": 747,
      "682619": 748,
      "543518": 749,
      "670128": 750,
      "668752": 751,
      "670869": 752,
      "595284": 753,
      "676761": 754,
      "680769": 755,
      "622268": 756,
      "665856": 757,
      "657247": 758,
      "667428": 759,
      "680737": 760,
      "656185": 761,
      "643348": 762,
      "676551": 763,
      "660636": 764,
      "640458": 765,
      "656514": 766,
      "656821": 767,
      "694355": 768,
      "676679": 769,
      "663731": 770,
      "542963": 771,
      "676625": 772,
      "675659": 773,
      "663604": 774,
      "686490": 775,
      "668663": 776,
      "425794": 777,
      "664670": 778,
      "641553": 779,
      "571740": 780,
      "682634": 781,
      "608360": 782,
      "622491": 783,
      "650619": 784,
      "687066": 785,
      "518586": 786,
      "608703": 787,
      "675915": 788
    },
    "stand": {
      "R": 1,
      "L": 2
    },
    "p_throws": {
      "R": 1,
      "L": 2
    },
    "inning_topbot": {
      "Bot": 1,
      "Top": 2
    },
    "count_state": {
      "1-2": 1,
      "0-2": 2,
      "2-2": 3,
      "0-0": 4,
      "0-1": 5,
      "1-0": 6,
      "3-0": 7,
      "1-1": 8,
      "2-1": 9,
      "2-0": 10,
      "3-2": 11,
      "3-1": 12
    },
    "prev_pitch_type": {
      "SL": 1,
      "FS": 2,
      "FF": 3,
      "START": 4,
      "CH": 5,
      "SI": 6,
      "ST": 7,
      "FC": 8,
      "CU": 9,
      "KC": 10,
      "SV": 11,
      "KN": 12,
      "FO": 13,
      "SC": 14,
      "FA": 15,
      "PO": 16,
      "CS": 17,
      "EP": 18
    },
    "base_state": {
      "2": 1,
      "0": 2,
      "6": 3,
      "1": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "7": 8
    }
  },
  "y_vocab": {
    "fastball": 1,
    "breaking": 2,
    "offspeed": 3
  },
  "feature_spec": {
    "target": "y_next_pitch_group",
    "cat_cols": [
      "pitcher",
      "batter",
      "stand",
      "p_throws",
      "inning_topbot",
      "count_state",
      "prev_pitch_type",
      "base_state"
    ],
    "num_cols": [
      "outs_when_up",
      "inning",
      "bat_score_diff",
      "pitcher_sit_fb_rate",
      "pitcher_sit_br_rate",
      "pitcher_sit_os_rate",
      "pitcher_sit_whiff_rate",
      "batter_sit_swing_rate",
      "batter_sit_whiff_rate"
    ]
  },
  "exported_at": "2026-05-12T23:50:28.518566"
}