{
  "cat_vocabs": {
    "pitcher": {
      "622491": 1,
      "669456": 2,
      "666374": 3,
      "663986": 4,
      "623149": 5,
      "675916": 6,
      "660853": 7,
      "662253": 8,
      "664285": 9,
      "656302": 10,
      "650556": 11,
      "593576": 12,
      "607481": 13,
      "606160": 14,
      "608665": 15,
      "519151": 16,
      "625643": 17,
      "666205": 18,
      "660271": 19,
      "667427": 20,
      "642758": 21,
      "623474": 22,
      "543507": 23,
      "571901": 24,
      "572193": 25,
      "666204": 26,
      "628711": 27,
      "668678": 28,
      "642121": 29,
      "669459": 30,
      "641360": 31,
      "672841": 32,
      "571946": 33,
      "656464": 34,
      "622075": 35,
      "571945": 36,
      "666201": 37,
      "668868": 38,
      "647315": 39,
      "657024": 40,
      "572403": 41,
      "641835": 42,
      "542914": 43,
      "669467": 44,
      "643256": 45,
      "663855": 46,
      "554340": 47,
      "664854": 48,
      "605447": 49,
      "668881": 50,
      "656605": 51,
      "518585": 52,
      "622065": 53,
      "664294": 54,
      "571882": 55,
      "642239": 56,
      "571656": 57,
      "670059": 58,
      "664139": 59,
      "670280": 60,
      "645261": 61,
      "453286": 62,
      "677053": 63,
      "656945": 64,
      "608638": 65,
      "622098": 66,
      "623211": 67,
      "548384": 68,
      "502085": 69,
      "425844": 70,
      "641154": 71,
      "607237": 72,
      "573204": 73,
      "669395": 74,
      "605347": 75,
      "621016": 76,
      "643377": 77,
      "672578": 78,
      "661395": 79,
      "663556": 80,
      "593958": 81,
      "671345": 82,
      "621363": 83,
      "592741": 84,
      "592094": 85,
      "669438": 86,
      "664126": 87,
      "573186": 88,
      "669203": 89,
      "657265": 90,
      "624522": 91,
      "681402": 92,
      "502202": 93,
      "642770": 94,
      "605242": 95,
      "605483": 96,
      "608566": 97,
      "622503": 98,
      "593619": 99,
      "659275": 100,
      "664875": 101,
      "621051": 102,
      "656234": 103,
      "594798": 104,
      "605400": 105,
      "666142": 106,
      "642397": 107,
      "641401": 108,
      "656271": 109,
      "607755": 110,
      "642546": 111,
      "571479": 112,
      "621381": 113,
      "600917": 114,
      "571578": 115,
      "608331": 116,
      "541640": 117,
      "476595": 118,
      "445926": 119,
      "666168": 120,
      "669276": 121,
      "543521": 122,
      "640451": 123,
      "640448": 124,
      "621345": 125,
      "543037": 126,
      "657277": 127,
      "593974": 128,
      "642528": 129,
      "605154": 130,
      "676760": 131,
      "643511": 132,
      "446372": 133,
      "502043": 134,
      "677161": 135,
      "518489": 136,
      "672391": 137,
      "669211": 138,
      "672335": 139,
      "670174": 140,
      "641329": 141,
      "670810": 142,
      "455119": 143,
      "642585": 144,
      "592662": 145,
      "683769": 146,
      "641627": 147,
      "680704": 148,
      "682171": 149,
      "623167": 150,
      "669212": 151,
      "661403": 152,
      "664299": 153,
      "458681": 154,
      "664208": 155,
      "669424": 156,
      "661527": 157,
      "518617": 158,
      "614179": 159,
      "669160": 160,
      "518876": 161,
      "686753": 162,
      "681911": 163,
      "543518": 164,
      "657571": 165,
      "605177": 166,
      "607259": 167,
      "607536": 168,
      "608718": 169,
      "657612": 170,
      "543272": 171,
      "472610": 172,
      "572955": 173,
      "666200": 174,
      "656849": 175,
      "488984": 176,
      "571670": 177,
      "595928": 178,
      "640462": 179,
      "669302": 180,
      "650644": 181,
      "650895": 182,
      "642100": 183,
      "670036": 184,
      "477132": 185,
      "518516": 186,
      "656578": 187,
      "608379": 188,
      "570632": 189,
      "621389": 190,
      "623352": 191,
      "543475": 192,
      "543243": 193,
      "642232": 194,
      "660896": 195,
      "664199": 196,
      "547973": 197,
      "543135": 198,
      "554430": 199,
      "628708": 200,
      "641540": 201,
      "621237": 202,
      "622554": 203,
      "518886": 204,
      "621368": 205,
      "680686": 206,
      "675911": 207,
      "607455": 208,
      "663658": 209,
      "623433": 210,
      "641729": 211,
      "665048": 212,
      "489446": 213,
      "621107": 214,
      "605513": 215,
      "622259": 216,
      "641302": 217,
      "687330": 218,
      "682051": 219,
      "664076": 220,
      "542585": 221,
      "676534": 222,
      "665795": 223,
      "656731": 224,
      "598264": 225,
      "642701": 226,
      "666129": 227,
      "493603": 228,
      "666157": 229,
      "448179": 230,
      "608328": 231,
      "665665": 232,
      "669796": 233,
      "664747": 234,
      "660261": 235,
      "663776": 236,
      "670124": 237,
      "656353": 238,
      "544727": 239,
      "594580": 240,
      "657006": 241,
      "605540": 242,
      "665871": 243,
      "456713": 244,
      "643410": 245,
      "642207": 246,
      "656427": 247,
      "592332": 248,
      "664353": 249,
      "608337": 250,
      "669854": 251,
      "523260": 252,
      "592773": 253,
      "666619": 254,
      "519242": 255,
      "665152": 256,
      "657508": 257,
      "543056": 258,
      "608723": 259,
      "670167": 260,
      "445276": 261,
      "657376": 262,
      "502171": 263,
      "596001": 264,
      "650633": 265,
      "656061": 266,
      "573124": 267,
      "605280": 268,
      "622772": 269,
      "666808": 270,
      "607625": 271,
      "596295": 272,
      "686610": 273,
      "542881": 274,
      "661309": 275,
      "681806": 276,
      "608032": 277,
      "594835": 278,
      "615698": 279,
      "682120": 280,
      "592789": 281,
      "605200": 282,
      "612434": 283,
      "623465": 284,
      "660813": 285,
      "656756": 286,
      "605135": 287,
      "670950": 288,
      "608717": 289,
      "676050": 290,
      "592791": 291,
      "641778": 292,
      "657240": 293,
      "621074": 294,
      "606303": 295,
      "640470": 296,
      "571948": 297,
      "527048": 298,
      "663559": 299,
      "519293": 300,
      "677651": 301,
      "605182": 302,
      "669432": 303,
      "673540": 304,
      "668665": 305,
      "605488": 306,
      "666214": 307,
      "656638": 308,
      "657044": 309,
      "656222": 310,
      "669022": 311,
      "694363": 312,
      "543859": 313,
      "605218": 314,
      "668933": 315,
      "592826": 316,
      "640444": 317,
      "621249": 318,
      "641745": 319,
      "657746": 320,
      "663558": 321,
      "605130": 322,
      "641941": 323,
      "666745": 324,
      "548389": 325,
      "663546": 326,
      "605155": 327,
      "518397": 328,
      "656557": 329,
      "608344": 330,
      "542947": 331,
      "675627": 332,
      "663372": 333,
      "657756": 334,
      "663903": 335,
      "621244": 336,
      "669923": 337,
      "672282": 338,
      "519043": 339,
      "650671": 340,
      "621076": 341,
      "668676": 342,
      "675540": 343,
      "677960": 344,
      "669194": 345,
      "641703": 346,
      "686613": 347,
      "571510": 348,
      "676710": 349,
      "670912": 350,
      "641482": 351,
      "592836": 352,
      "641656": 353,
      "592351": 354,
      "680694": 355,
      "669330": 356,
      "453178": 357,
      "663765": 358,
      "450203": 359,
      "656818": 360,
      "592767": 361,
      "456501": 362,
      "641816": 363,
      "689167": 364,
      "663485": 365,
      "607732": 366,
      "656629": 367,
      "543101": 368,
      "640455": 369,
      "642547": 370,
      "471911": 371,
      "669060": 372,
      "592866": 373,
      "656876": 374,
      "666159": 375,
      "660761": 376,
      "642545": 377,
      "676664": 378,
      "663460": 379,
      "579328": 380,
      "571760": 381,
      "593334": 382,
      "571927": 383,
      "689266": 384,
      "606149": 385,
      "489119": 386,
      "660593": 387,
      "601713": 388,
      "672710": 389,
      "628317": 390,
      "641771": 391,
      "676596": 392,
      "570666": 393,
      "669713": 394,
      "669270": 395,
      "506433": 396,
      "680570": 397,
      "693821": 398,
      "622072": 399,
      "669947": 400,
      "641447": 401,
      "666818": 402,
      "664849": 403,
      "656981": 404,
      "623437": 405,
      "656266": 406,
      "650893": 407,
      "643361": 408,
      "681987": 409,
      "656970": 410,
      "686842": 411,
      "641871": 412,
      "642578": 413,
      "657140": 414,
      "676477": 415,
      "676083": 416,
      "663385": 417,
      "671737": 418,
      "656288": 419,
      "685410": 420,
      "607067": 421,
      "668754": 422,
      "543548": 423,
      "663687": 424,
      "622251": 425,
      "596112": 426,
      "666974": 427,
      "630023": 428,
      "686973": 429,
      "622250": 430,
      "668984": 431,
      "665001": 432,
      "621383": 433,
      "547179": 434,
      "663947": 435,
      "663562": 436,
      "676130": 437,
      "663992": 438,
      "642231": 439,
      "666277": 440,
      "657031": 441,
      "656814": 442,
      "677865": 443,
      "663753": 444,
      "670766": 445,
      "676701": 446,
      "676714": 447,
      "678394": 448,
      "681867": 449,
      "656257": 450,
      "573009": 451,
      "668941": 452,
      "669711": 453,
      "642048": 454,
      "687396": 455,
      "695243": 456,
      "670990": 457,
      "453268": 458,
      "686651": 459,
      "608371": 460,
      "664948": 461,
      "596133": 462,
      "663941": 463,
      "664192": 464,
      "678061": 465,
      "596082": 466,
      "669093": 467,
      "681810": 468,
      "605397": 469,
      "680573": 470,
      "676684": 471,
      "595345": 472,
      "650911": 473,
      "670955": 474,
      "641927": 475,
      "671106": 476,
      "665625": 477,
      "674072": 478,
      "592222": 479,
      "664776": 480,
      "543594": 481,
      "657514": 482,
      "669674": 483,
      "598286": 484,
      "663773": 485,
      "624647": 486,
      "663878": 487,
      "592390": 488,
      "663455": 489,
      "665622": 490,
      "681217": 491,
      "664062": 492,
      "641420": 493,
      "676440": 494,
      "592779": 495,
      "607968": 496,
      "668873": 497,
      "668834": 498,
      "669084": 499,
      "607179": 500,
      "676680": 501,
      "675989": 502,
      "657041": 503,
      "666720": 504,
      "683232": 505,
      "680739": 506,
      "606965": 507,
      "668338": 508,
      "600921": 509,
      "676265": 510,
      "656232": 511,
      "682243": 512,
      "657424": 513,
      "670871": 514,
      "517008": 515,
      "629498": 516,
      "694297": 517,
      "694813": 518,
      "502624": 519,
      "669105": 520,
      "663623": 521,
      "643493": 522,
      "607359": 523,
      "670329": 524,
      "671111": 525,
      "680735": 526,
      "434378": 527,
      "608678": 528,
      "593833": 529,
      "669169": 530,
      "622608": 531,
      "641585": 532,
      "672730": 533,
      "621433": 534,
      "628452": 535,
      "656546": 536,
      "656529": 537,
      "543351": 538,
      "425794": 539,
      "592346": 540,
      "605288": 541,
      "686972": 542,
      "641793": 543,
      "656412": 544,
      "664942": 545,
      "666721": 546,
      "656986": 547,
      "682847": 548,
      "656820": 549,
      "663567": 550,
      "665620": 551,
      "543901": 552,
      "594902": 553,
      "605446": 554,
      "572020": 555,
      "691587": 556,
      "624133": 557,
      "594943": 558,
      "667463": 559,
      "670183": 560,
      "641427": 561,
      "611093": 562,
      "674003": 563,
      "656290": 564,
      "682227": 565,
      "595411": 566,
      "621057": 567,
      "677020": 568,
      "595897": 569,
      "669618": 570,
      "669461": 571,
      "656730": 572,
      "570257": 573,
      "592229": 574,
      "592254": 575,
      "472551": 576,
      "666207": 577,
      "594577": 578,
      "676979": 579,
      "592848": 580,
      "663804": 581,
      "668674": 582,
      "664202": 583,
      "666154": 584,
      "641672": 585,
      "657272": 586,
      "613534": 587,
      "571539": 588,
      "676254": 589,
      "606625": 590,
      "622663": 591,
      "571710": 592,
      "656786": 593,
      "657097": 594,
      "676272": 595,
      "621295": 596,
      "674285": 597,
      "543294": 598,
      "527054": 599,
      "696147": 600,
      "663629": 601,
      "681190": 602,
      "607192": 603,
      "663738": 604,
      "621112": 605,
      "647336": 606,
      "690829": 607,
      "521230": 608,
      "686747": 609,
      "663971": 610,
      "681982": 611,
      "592426": 612,
      "592454": 613,
      "681857": 614,
      "605463": 615,
      "622780": 616,
      "660787": 617,
      "667755": 618,
      "693433": 619,
      "645801": 620,
      "669145": 621,
      "700363": 622,
      "663474": 623,
      "542888": 624,
      "671096": 625,
      "687798": 626,
      "669684": 627,
      "571616": 628,
      "675921": 629,
      "672715": 630,
      "622103": 631,
      "673111": 632,
      "670102": 633,
      "669952": 634,
      "543063": 635,
      "592473": 636,
      "686654": 637,
      "676689": 638,
      "682175": 639,
      "663752": 640,
      "605151": 641,
      "650960": 642,
      "669391": 643,
      "676775": 644,
      "641743": 645,
      "674370": 646,
      "657585": 647,
      "686839": 648,
      "686218": 649,
      "657053": 650,
      "669387": 651,
      "640454": 652,
      "621294": 653,
      "663542": 654,
      "668970": 655,
      "688427": 656,
      "596057": 657,
      "668942": 658,
      "666364": 659,
      "621139": 660,
      "681869": 661,
      "701643": 662,
      "621366": 663,
      "663423": 664,
      "661383": 665,
      "668909": 666,
      "670970": 667,
      "687888": 668,
      "605441": 669,
      "657697": 670,
      "663362": 671,
      "502179": 672,
      "691094": 673,
      "673858": 674,
      "571863": 675,
      "663704": 676,
      "622110": 677,
      "570731": 678,
      "519008": 679,
      "686294": 680,
      "663465": 681,
      "676475": 682,
      "682989": 683,
      "679525": 684,
      "543339": 685,
      "657248": 686,
      "663989": 687,
      "623381": 688,
      "621219": 689,
      "677076": 690,
      "678606": 691,
      "545121": 692,
      "656657": 693,
      "518626": 694,
      "641712": 695,
      "543766": 696,
      "658648": 697,
      "676092": 698,
      "681808": 699,
      "669373": 700,
      "620454": 701,
      "694037": 702,
      "664028": 703,
      "650496": 704,
      "660825": 705,
      "663574": 706,
      "661440": 707,
      "679885": 708,
      "663462": 709,
      "676632": 710,
      "681517": 711,
      "670097": 712,
      "660730": 713,
      "665734": 714,
      "607074": 715,
      "672851": 716,
      "656457": 717,
      "682842": 718,
      "676395": 719,
      "689225": 720,
      "656382": 721,
      "689690": 722,
      "676206": 723,
      "547184": 724,
      "607188": 725,
      "682990": 726,
      "682967": 727,
      "666208": 728,
      "500779": 729,
      "672860": 730,
      "663158": 731,
      "642216": 732,
      "680232": 733,
      "678226": 734,
      "605498": 735,
      "686539": 736,
      "679346": 737,
      "641755": 738,
      "669912": 739,
      "547943": 740,
      "607216": 741,
      "672582": 742,
      "677944": 743,
      "664129": 744,
      "680689": 745,
      "572971": 746,
      "682010": 747,
      "622569": 748,
      "676106": 749,
      "681882": 750,
      "656924": 751,
      "670046": 752,
      "668470": 753,
      "607457": 754,
      "660906": 755,
      "682052": 756,
      "656322": 757,
      "686826": 758,
      "657093": 759,
      "596271": 760,
      "660431": 761,
      "669111": 762,
      "552640": 763,
      "686752": 764,
      "680723": 765,
      "690986": 766,
      "606930": 767,
      "656887": 768,
      "656794": 769,
      "687145": 770,
      "696136": 771,
      "681892": 772,
      "674444": 773,
      "670241": 774,
      "643338": 775,
      "622766": 776,
      "622088": 777,
      "665896": 778,
      "686730": 779,
      "572888": 780,
      "592527": 781,
      "685314": 782,
      "683175": 783,
      "676702": 784,
      "681432": 785,
      "646242": 786,
      "669721": 787,
      "687922": 788,
      "600986": 789,
      "646241": 790,
      "680767": 791,
      "687830": 792,
      "623451": 793,
      "663321": 794,
      "669165": 795,
      "502083": 796,
      "621199": 797,
      "607644": 798,
      "671131": 799,
      "671212": 800,
      "656641": 801,
      "693312": 802,
      "683155": 803,
      "669724": 804,
      "664744": 805,
      "608334": 806,
      "689147": 807,
      "663978": 808,
      "685107": 809,
      "680742": 810,
      "680983": 811,
      "672782": 812,
      "676961": 813,
      "663432": 814,
      "593423": 815,
      "674681": 816,
      "656793": 817,
      "641149": 818,
      "608648": 819,
      "673513": 820,
      "808967": 821,
      "656420": 822,
      "663568": 823,
      "669062": 824,
      "669622": 825,
      "664350": 826,
      "676617": 827,
      "622253": 828,
      "683627": 829,
      "694738": 830,
      "687765": 831,
      "572143": 832,
      "676962": 833,
      "686580": 834,
      "554431": 835,
      "671922": 836,
      "595881": 837,
      "621242": 838,
      "683003": 839,
      "458677": 840,
      "673929": 841,
      "621097": 842,
      "641726": 843,
      "678906": 844,
      "661269": 845,
      "669422": 846,
      "607200": 847,
      "676974": 848,
      "687014": 849,
      "684007": 850,
      "661563": 851,
      "620982": 852,
      "681676": 853,
      "605452": 854,
      "592288": 855,
      "663554": 856,
      "542882": 857,
      "593934": 858,
      "676969": 859,
      "668874": 860,
      "656671": 861,
      "519326": 862,
      "676879": 863,
      "673380": 864,
      "681293": 865,
      "664079": 866,
      "605121": 867,
      "684320": 868,
      "666163": 869,
      "547001": 870,
      "668390": 871,
      "657649": 872,
      "680730": 873,
      "676568": 874,
      "680897": 875,
      "666215": 876,
      "689017": 877,
      "686563": 878,
      "544150": 879,
      "663531": 880,
      "683004": 881,
      "592155": 882,
      "682610": 883,
      "678692": 884,
      "668964": 885,
      "663893": 886,
      "687424": 887,
      "667725": 888,
      "642629": 889,
      "670219": 890,
      "694361": 891,
      "655889": 892,
      "686796": 893,
      "683822": 894,
      "681035": 895,
      "678495": 896,
      "656896": 897,
      "681871": 898,
      "595014": 899,
      "696131": 900,
      "621111": 901,
      "688297": 902,
      "621053": 903,
      "688107": 904,
      "694973": 905,
      "622694": 906,
      "605156": 907,
      "641312": 908,
      "687863": 909,
      "622786": 910,
      "672552": 911,
      "642520": 912,
      "660600": 913,
      "642028": 914,
      "672456": 915,
      "680885": 916,
      "679845": 917,
      "686993": 918,
      "669620": 919,
      "621114": 920,
      "702795": 921,
      "683409": 922,
      "687792": 923,
      "800049": 924,
      "656716": 925,
      "700249": 926,
      "528748": 927,
      "703231": 928,
      "694462": 929,
      "641343": 930,
      "671305": 931,
      "656186": 932,
      "689672": 933,
      "692230": 934,
      "702352": 935,
      "656550": 936,
      "685126": 937,
      "656848": 938,
      "680572": 939,
      "687134": 940,
      "814005": 941,
      "668968": 942,
      "687911": 943,
      "664351": 944,
      "670103": 945,
      "675650": 946,
      "691172": 947,
      "806185": 948,
      "678368": 949,
      "701581": 950,
      "656354": 951,
      "700669": 952,
      "690544": 953,
      "681799": 954,
      "691441": 955,
      "669358": 956,
      "679156": 957,
      "680736": 958,
      "685299": 959,
      "663969": 960,
      "679358": 961,
      "700270": 962,
      "685801": 963,
      "642016": 964,
      "686799": 965,
      "669308": 966,
      "596117": 967,
      "676604": 968,
      "689981": 969,
      "694646": 970,
      "663436": 971,
      "676282": 972,
      "676614": 973,
      "685116": 974,
      "701542": 975,
      "686642": 976,
      "700241": 977,
      "677976": 978,
      "674944": 979,
      "676428": 980,
      "687362": 981,
      "681066": 982,
      "543238": 983,
      "670161": 984,
      "667297": 985,
      "676661": 986,
      "700187": 987,
      "656240": 988,
      "805673": 989,
      "687377": 990,
      "663767": 991,
      "641582": 992,
      "656458": 993,
      "680880": 994,
      "687924": 995,
      "676105": 996,
      "669372": 997,
      "680891": 998,
      "543391": 999,
      "678821": 1000,
      "660644": 1001,
      "666171": 1002,
      "641658": 1003,
      "621399": 1004,
      "680744": 1005,
      "668943": 1006,
      "642834": 1007,
      "667478": 1008,
      "605335": 1009,
      "691951": 1010,
      "695076": 1011,
      "678020": 1012,
      "571527": 1013,
      "676508": 1014,
      "694350": 1015,
      "664123": 1016,
      "702674": 1017,
      "571771": 1018,
      "683568": 1019,
      "681870": 1020,
      "682254": 1021,
      "682073": 1022,
      "677955": 1023,
      "686751": 1024,
      "669199": 1025,
      "690916": 1026,
      "692285": 1027,
      "680732": 1028,
      "677958": 1029,
      "689958": 1030,
      "683068": 1031,
      "671109": 1032,
      "657193": 1033,
      "676755": 1034,
      "683021": 1035,
      "683618": 1036,
      "690925": 1037,
      "695549": 1038,
      "681347": 1039,
      "687847": 1040,
      "686790": 1041
    },
    "batter": {
      "680757": 1,
      "642708": 2,
      "608070": 3,
      "677594": 4,
      "543939": 5,
      "664034": 6,
      "606192": 7,
      "605137": 8,
      "647304": 9,
      "665926": 10,
      "663728": 11,
      "553993": 12,
      "672284": 13,
      "600303": 14,
      "686823": 15,
      "572287": 16,
      "664702": 17,
      "641487": 18,
      "641313": 19,
      "673357": 20,
      "683734": 21,
      "665161": 22,
      "608324": 23,
      "670541": 24,
      "547989": 25,
      "660162": 26,
      "643217": 27,
      "518735": 28,
      "663656": 29,
      "673237": 30,
      "676694": 31,
      "462101": 32,
      "663853": 33,
      "455117": 34,
      "643289": 35,
      "650391": 36,
      "693049": 37,
      "621493": 38,
      "545361": 39,
      "660271": 40,
      "643393": 41,
      "668843": 42,
      "649557": 43,
      "664913": 44,
      "543685": 45,
      "592669": 46,
      "650859": 47,
      "542583": 48,
      "657656": 49,
      "607054": 50,
      "592273": 51,
      "570482": 52,
      "681351": 53,
      "669127": 54,
      "665923": 55,
      "667670": 56,
      "641786": 57,
      "606466": 58,
      "666971": 59,
      "572233": 60,
      "605141": 61,
      "518692": 62,
      "571970": 63,
      "682998": 64,
      "672515": 65,
      "664983": 66,
      "502110": 67,
      "444482": 68,
      "678246": 69,
      "681546": 70,
      "500743": 71,
      "669257": 72,
      "446334": 73,
      "605113": 74,
      "543807": 75,
      "666182": 76,
      "665489": 77,
      "662139": 78,
      "672386": 79,
      "474832": 80,
      "656305": 81,
      "593160": 82,
      "680977": 83,
      "663457": 84,
      "502671": 85,
      "575929": 86,
      "641933": 87,
      "595281": 88,
      "669357": 89,
      "691023": 90,
      "669242": 91,
      "571448": 92,
      "624415": 93,
      "668800": 94,
      "668804": 95,
      "457705": 96,
      "467793": 97,
      "675986": 98,
      "663697": 99,
      "670770": 100,
      "641584": 101,
      "613564": 102,
      "663647": 103,
      "669261": 104,
      "595978": 105,
      "571976": 106,
      "668715": 107,
      "666181": 108,
      "676480": 109,
      "665833": 110,
      "663886": 111,
      "678225": 112,
      "607043": 113,
      "516782": 114,
      "596019": 115,
      "650333": 116,
      "516416": 117,
      "643265": 118,
      "624413": 119,
      "643446": 120,
      "592192": 121,
      "665862": 122,
      "624585": 123,
      "541645": 124,
      "596129": 125,
      "500871": 126,
      "553882": 127,
      "650559": 128,
      "607732": 129,
      "621563": 130,
      "502054": 131,
      "542932": 132,
      "621043": 133,
      "621439": 134,
      "663616": 135,
      "669304": 136,
      "624503": 137,
      "677951": 138,
      "669004": 139,
      "521692": 140,
      "608336": 141,
      "543877": 142,
      "572191": 143,
      "686469": 144,
      "614177": 145,
      "686681": 146,
      "596146": 147,
      "641531": 148,
      "664728": 149,
      "658668": 150,
      "571657": 151,
      "456781": 152,
      "663837": 153,
      "595879": 154,
      "682985": 155,
      "606992": 156,
      "650490": 157,
      "670623": 158,
      "668227": 159,
      "679529": 160,
      "640457": 161,
      "570731": 162,
      "623912": 163,
      "622534": 164,
      "664040": 165,
      "668952": 166,
      "642350": 167,
      "408234": 168,
      "677551": 169,
      "670042": 170,
      "542194": 171,
      "670764": 172,
      "656716": 173,
      "665155": 174,
      "592885": 175,
      "608385": 176,
      "642715": 177,
      "642133": 178,
      "661388": 179,
      "663538": 180,
      "621020": 181,
      "664023": 182,
      "641355": 183,
      "649966": 184,
      "669003": 185,
      "605119": 186,
      "641820": 187,
      "543228": 188,
      "543333": 189,
      "621550": 190,
      "670156": 191,
      "668930": 192,
      "602074": 193,
      "592178": 194,
      "453568": 195,
      "543068": 196,
      "660707": 197,
      "641857": 198,
      "663757": 199,
      "665742": 200,
      "592518": 201,
      "593428": 202,
      "630105": 203,
      "553869": 204,
      "605612": 205,
      "678662": 206,
      "572761": 207,
      "543592": 208,
      "673490": 209,
      "621311": 210,
      "607208": 211,
      "656941": 212,
      "592663": 213,
      "543760": 214,
      "608369": 215,
      "663993": 216,
      "666969": 217,
      "669742": 218,
      "681082": 219,
      "664761": 220,
      "595909": 221,
      "641680": 222,
      "543257": 223,
      "669016": 224,
      "592206": 225,
      "543543": 226,
      "669701": 227,
      "673962": 228,
      "669352": 229,
      "660670": 230,
      "621566": 231,
      "663586": 232,
      "645277": 233,
      "669221": 234,
      "608841": 235,
      "600869": 236,
      "671739": 237,
      "518595": 238,
      "606115": 239,
      "642086": 240,
      "669743": 241,
      "671277": 242,
      "542303": 243,
      "682928": 244,
      "657041": 245,
      "660688": 246,
      "645302": 247,
      "572816": 248,
      "656541": 249,
      "664774": 250,
      "624424": 251,
      "527038": 252,
      "592626": 253,
      "518934": 254,
      "592450": 255,
      "519203": 256,
      "519317": 257,
      "518626": 258,
      "573262": 259,
      "642731": 260,
      "543063": 261,
      "666165": 262,
      "665828": 263,
      "624431": 264,
      "547379": 265,
      "683011": 266,
      "605204": 267,
      "681584": 268,
      "650402": 269,
      "607461": 270,
      "656775": 271,
      "668939": 272,
      "623993": 273,
      "663624": 274,
      "683002": 275,
      "602104": 276,
      "657077": 277,
      "646240": 278,
      "457759": 279,
      "807799": 280,
      "669720": 281,
      "624428": 282,
      "622761": 283,
      "594807": 284,
      "671213": 285,
      "624414": 286,
      "571771": 287,
      "624512": 288,
      "657136": 289,
      "606132": 290,
      "660757": 291,
      "669450": 292,
      "657757": 293,
      "667452": 294,
      "682073": 295,
      "668942": 296,
      "677950": 297,
      "672695": 298,
      "443558": 299,
      "640492": 300,
      "493329": 301,
      "621512": 302,
      "663743": 303,
      "641645": 304,
      "595956": 305,
      "608596": 306,
      "572204": 307,
      "605131": 308,
      "621035": 309,
      "518792": 310,
      "645444": 311,
      "669134": 312,
      "519058": 313,
      "596059": 314,
      "681987": 315,
      "670032": 316,
      "641598": 317,
      "596117": 318,
      "543281": 319,
      "677649": 320,
      "665506": 321,
      "592696": 322,
      "545121": 323,
      "681481": 324,
      "666139": 325,
      "642336": 326,
      "668670": 327,
      "660821": 328,
      "656582": 329,
      "666801": 330,
      "621028": 331,
      "656413": 332,
      "592200": 333,
      "596847": 334,
      "571875": 335,
      "669397": 336,
      "664058": 337,
      "676116": 338,
      "542208": 339,
      "670712": 340,
      "572228": 341,
      "621458": 342,
      "680911": 343,
      "571466": 344,
      "663611": 345,
      "620443": 346,
      "643376": 347,
      "676475": 348,
      "664874": 349,
      "676801": 350,
      "663630": 351,
      "669369": 352,
      "543305": 353,
      "595777": 354,
      "661531": 355,
      "642136": 356,
      "572041": 357,
      "672356": 358,
      "664059": 359,
      "650619": 360,
      "666185": 361,
      "669289": 362,
      "605170": 363,
      "686894": 364,
      "624641": 365,
      "663967": 366,
      "641796": 367,
      "680777": 368,
      "598265": 369,
      "622110": 370,
      "643396": 371,
      "543309": 372,
      "608701": 373,
      "679631": 374,
      "644374": 375,
      "669065": 376,
      "676701": 377,
      "641511": 378,
      "614173": 379,
      "621532": 380,
      "571912": 381,
      "621433": 382,
      "607680": 383,
      "660766": 384,
      "600301": 385,
      "623168": 386,
      "650489": 387,
      "656180": 388,
      "656308": 389,
      "668472": 390,
      "593643": 391,
      "641658": 392,
      "656448": 393,
      "669394": 394,
      "656669": 395,
      "665019": 396,
      "668731": 397,
      "656976": 398,
      "608671": 399,
      "642851": 400,
      "671218": 401,
      "682626": 402,
      "642201": 403,
      "501303": 404,
      "670242": 405,
      "543510": 406,
      "660644": 407,
      "664029": 408,
      "675656": 409,
      "641432": 410,
      "666915": 411,
      "663698": 412,
      "676369": 413,
      "641525": 414,
      "665750": 415,
      "506702": 416,
      "666397": 417,
      "672820": 418,
      "573131": 419,
      "664247": 420,
      "663527": 421,
      "656811": 422,
      "669222": 423,
      "673548": 424,
      "642180": 425,
      "687093": 426,
      "672779": 427,
      "687263": 428,
      "644433": 429,
      "683146": 430,
      "664770": 431,
      "680776": 432,
      "663897": 433,
      "676609": 434,
      "664954": 435,
      "689172": 436,
      "672724": 437,
      "671289": 438,
      "665839": 439,
      "672478": 440,
      "660634": 441,
      "665487": 442,
      "593871": 443,
      "595453": 444,
      "663368": 445,
      "657557": 446,
      "666023": 447,
      "592656": 448,
      "596103": 449,
      "571745": 450,
      "686668": 451,
      "656896": 452,
      "683737": 453,
      "543482": 454,
      "656514": 455,
      "687401": 456,
      "676625": 457,
      "545341": 458,
      "670097": 459,
      "628451": 460,
      "609280": 461,
      "669023": 462,
      "608703": 463,
      "666150": 464,
      "666211": 465,
      "656495": 466,
      "547180": 467,
      "621438": 468,
      "672580": 469,
      "670276": 470,
      "664056": 471,
      "669364": 472,
      "668709": 473,
      "680814": 474,
      "641343": 475,
      "571740": 476,
      "665804": 477,
      "669699": 478,
      "670223": 479,
      "666135": 480,
      "656024": 481,
      "641553": 482,
      "572008": 483,
      "681807": 484,
      "608360": 485,
      "666624": 486,
      "666906": 487,
      "669477": 488,
      "641943": 489,
      "669087": 490,
      "666160": 491,
      "622569": 492,
      "605421": 493,
      "680574": 494,
      "669911": 495,
      "677587": 496,
      "668901": 497,
      "640458": 498,
      "545350": 499,
      "670869": 500,
      "514888": 501,
      "666163": 502,
      "665120": 503,
      "643565": 504,
      "672275": 505,
      "640449": 506,
      "656185": 507,
      "596142": 508,
      "666310": 509,
      "641505": 510,
      "668663": 511,
      "676391": 512,
      "671221": 513,
      "666134": 514,
      "655316": 515,
      "668904": 516,
      "681146": 517,
      "647351": 518,
      "645801": 519,
      "656403": 520,
      "663845": 521,
      "572138": 522,
      "686759": 523,
      "623507": 524,
      "663609": 525,
      "682829": 526,
      "676356": 527,
      "666197": 528,
      "664238": 529,
      "666176": 530,
      "641856": 531,
      "663796": 532,
      "608348": 533,
      "680118": 534,
      "682641": 535,
      "623205": 536,
      "595751": 537,
      "621545": 538,
      "683021": 539,
      "669392": 540,
      "687462": 541,
      "676070": 542,
      "680779": 543,
      "458015": 544,
      "663731": 545,
      "656821": 546,
      "668751": 547,
      "656537": 548,
      "666152": 549,
      "656371": 550,
      "693304": 551,
      "676632": 552,
      "664901": 553,
      "643348": 554,
      "676059": 555,
      "676724": 556,
      "669707": 557,
      "605242": 558,
      "444489": 559,
      "621466": 560,
      "667472": 561,
      "663330": 562,
      "681297": 563,
      "671056": 564,
      "676946": 565,
      "686527": 566,
      "666018": 567,
      "642137": 568,
      "665877": 569,
      "691016": 570,
      "680869": 571,
      "663550": 572,
      "679032": 573,
      "518586": 574,
      "682848": 575,
      "678894": 576,
      "687952": 577,
      "670128": 578,
      "687799": 579,
      "686217": 580,
      "650907": 581,
      "675961": 582,
      "682617": 583,
      "663898": 584,
      "660636": 585,
      "542364": 586,
      "660620": 587,
      "677941": 588,
      "681962": 589,
      "676914": 590,
      "666164": 591,
      "594777": 592,
      "677588": 593,
      "678554": 594,
      "596115": 595,
      "657061": 596,
      "657088": 597,
      "501659": 598,
      "642215": 599,
      "679881": 600,
      "671732": 601,
      "671083": 602,
      "678545": 603,
      "685133": 604,
      "622666": 605,
      "592325": 606,
      "680700": 607,
      "657247": 608,
      "694384": 609,
      "691026": 610,
      "641470": 611,
      "682622": 612,
      "678009": 613,
      "677800": 614,
      "677592": 615,
      "666198": 616,
      "605361": 617,
      "672279": 618,
      "686676": 619,
      "696285": 620,
      "696100": 621,
      "686452": 622,
      "488726": 623,
      "669200": 624,
      "678882": 625,
      "677347": 626,
      "656248": 627,
      "686531": 628,
      "691176": 629,
      "669224": 630,
      "679845": 631,
      "677595": 632,
      "663905": 633,
      "664057": 634,
      "672744": 635,
      "691783": 636,
      "694497": 637,
      "664670": 638,
      "680716": 639,
      "666703": 640,
      "691718": 641,
      "664314": 642,
      "682515": 643,
      "677008": 644,
      "578570": 645,
      "656484": 646,
      "680418": 647,
      "666149": 648,
      "676761": 649,
      "691406": 650,
      "571980": 651,
      "425794": 652,
      "686490": 653,
      "666158": 654,
      "701538": 655,
      "688363": 656,
      "694671": 657,
      "808982": 658,
      "687363": 659,
      "690993": 660,
      "593934": 661,
      "677942": 662,
      "687231": 663,
      "694192": 664,
      "656555": 665,
      "668832": 666,
      "686554": 667,
      "702358": 668,
      "668853": 669,
      "668885": 670,
      "678489": 671,
      "543518": 672,
      "683083": 673,
      "679822": 674,
      "686780": 675,
      "672761": 676,
      "673995": 677,
      "702616": 678,
      "592348": 679,
      "680474": 680,
      "682729": 681,
      "672640": 682,
      "681624": 683,
      "675915": 684,
      "665856": 685,
      "640902": 686,
      "680718": 687,
      "660844": 688,
      "672012": 689,
      "687597": 690,
      "694388": 691,
      "656577": 692,
      "695391": 693,
      "682868": 694,
      "656883": 695,
      "700932": 696,
      "668723": 697,
      "674441": 698,
      "676896": 699,
      "671286": 700,
      "676113": 701,
      "676679": 702,
      "663662": 703,
      "669208": 704,
      "670092": 705,
      "667428": 706,
      "578428": 707,
      "682177": 708,
      "623520": 709,
      "642197": 710,
      "681393": 711,
      "669234": 712,
      "694362": 713,
      "668752": 714,
      "675659": 715,
      "691182": 716,
      "682988": 717,
      "665561": 718,
      "700250": 719,
      "682619": 720,
      "645305": 721,
      "682657": 722,
      "680769": 723,
      "682119": 724,
      "669137": 725,
      "695238": 726,
      "677870": 727,
      "678877": 728,
      "668845": 729,
      "622491": 730,
      "695578": 731,
      "686797": 732,
      "669374": 733,
      "677956": 734,
      "672642": 735,
      "805779": 736,
      "681460": 737,
      "665966": 738,
      "642020": 739,
      "805373": 740,
      "693307": 741,
      "676439": 742,
      "687066": 743,
      "665782": 744,
      "686765": 745,
      "670224": 746,
      "691723": 747,
      "666464": 748,
      "694175": 749,
      "641779": 750,
      "701305": 751,
      "680728": 752,
      "681508": 753,
      "665953": 754,
      "687529": 755,
      "694359": 756,
      "690291": 757,
      "700242": 758,
      "605346": 759,
      "694376": 760,
      "691011": 761,
      "542963": 762,
      "595284": 763,
      "686611": 764,
      "665052": 765,
      "694355": 766,
      "672701": 767,
      "676551": 768,
      "686482": 769,
      "680737": 770,
      "671117": 771,
      "660758": 772,
      "669326": 773,
      "680577": 774,
      "695257": 775,
      "686555": 776,
      "691594": 777,
      "605244": 778,
      "657193": 779,
      "695336": 780,
      "676572": 781,
      "622268": 782,
      "682668": 783,
      "663604": 784,
      "672569": 785,
      "694377": 786,
      "682634": 787,
      "687957": 788
    },
    "stand": {
      "L": 1,
      "R": 2
    },
    "p_throws": {
      "R": 1,
      "L": 2
    },
    "inning_topbot": {
      "Top": 1,
      "Bot": 2
    },
    "count_state": {
      "0-0": 1,
      "1-0": 2,
      "2-0": 3,
      "3-0": 4,
      "3-1": 5,
      "0-1": 6,
      "1-1": 7,
      "1-2": 8,
      "2-2": 9,
      "2-1": 10,
      "0-2": 11,
      "3-2": 12,
      "4-1": 13
    },
    "prev_pitch_type": {
      "START": 1,
      "FF": 2,
      "SI": 3,
      "FC": 4,
      "SL": 5,
      "CH": 6,
      "KC": 7,
      "FS": 8,
      "CU": 9,
      "ST": 10,
      "SV": 11,
      "FO": 12,
      "FA": 13,
      "SC": 14,
      "CS": 15,
      "PO": 16,
      "EP": 17,
      "KN": 18
    },
    "base_state": {
      "0": 1,
      "1": 2,
      "2": 3,
      "4": 4,
      "3": 5,
      "6": 6,
      "7": 7,
      "5": 8
    }
  },
  "y_vocab": {
    "fastball": 1,
    "breaking": 2,
    "offspeed": 3
  },
  "feature_spec": {
    "target": "y_next_pitch_group",
    "cat_cols": [
      "pitcher",
      "batter",
      "stand",
      "p_throws",
      "inning_topbot",
      "count_state",
      "prev_pitch_type",
      "base_state"
    ],
    "num_cols": [
      "outs_when_up",
      "inning",
      "bat_score_diff",
      "pitcher_sit_fb_rate",
      "pitcher_sit_br_rate",
      "pitcher_sit_os_rate",
      "pitcher_sit_whiff_rate",
      "batter_sit_swing_rate",
      "batter_sit_whiff_rate",
      "pitch_number"
    ]
  },
  "exported_at": "2026-05-01T12:29:31.291813"
}