{
  "cat_vocabs": {
    "pitcher": {
      "656061": 1,
      "674003": 2,
      "656638": 3,
      "660261": 4,
      "666200": 5,
      "669302": 6,
      "661563": 7,
      "676092": 8,
      "605182": 9,
      "663568": 10,
      "572955": 11,
      "548389": 12,
      "592866": 13,
      "642545": 14,
      "663893": 15,
      "621366": 16,
      "656578": 17,
      "674072": 18,
      "693433": 19,
      "592791": 20,
      "682120": 21,
      "669022": 22,
      "663559": 23,
      "666129": 24,
      "680767": 25,
      "682610": 26,
      "605154": 27,
      "668941": 28,
      "678394": 29,
      "680885": 30,
      "664062": 31,
      "669923": 32,
      "680570": 33,
      "681293": 34,
      "502085": 35,
      "666142": 36,
      "605498": 37,
      "666619": 38,
      "666745": 39,
      "669373": 40,
      "686730": 41,
      "665152": 42,
      "592155": 43,
      "641745": 44,
      "621237": 45,
      "663562": 46,
      "554340": 47,
      "676440": 48,
      "656412": 49,
      "676130": 50,
      "656731": 51,
      "669438": 52,
      "543859": 53,
      "669194": 54,
      "666157": 55,
      "666205": 56,
      "681911": 57,
      "681892": 58,
      "613534": 59,
      "660853": 60,
      "689690": 61,
      "607259": 62,
      "640455": 63,
      "664285": 64,
      "657746": 65,
      "608337": 66,
      "579328": 67,
      "641793": 68,
      "519242": 69,
      "502043": 70,
      "669912": 71,
      "656657": 72,
      "450203": 73,
      "676664": 74,
      "628711": 75,
      "670766": 76,
      "664192": 77,
      "664294": 78,
      "592454": 79,
      "605483": 80,
      "657006": 81,
      "668868": 82,
      "668881": 83,
      "628708": 84,
      "453286": 85,
      "806185": 86,
      "607536": 87,
      "605488": 88,
      "687765": 89,
      "676272": 90,
      "666364": 91,
      "657376": 92,
      "594580": 93,
      "686753": 94,
      "663623": 95,
      "683769": 96,
      "453178": 97,
      "605130": 98,
      "676710": 99,
      "663773": 100,
      "573186": 101,
      "621244": 102,
      "594902": 103,
      "605347": 104,
      "592662": 105,
      "671922": 106,
      "667297": 107,
      "656849": 108,
      "676265": 109,
      "661527": 110,
      "458681": 111,
      "642216": 112,
      "608371": 113,
      "672710": 114,
      "682227": 115,
      "669395": 116,
      "687134": 117,
      "640470": 118,
      "671106": 119,
      "640448": 120,
      "656945": 121,
      "607192": 122,
      "544150": 123,
      "664854": 124,
      "543135": 125,
      "596133": 126,
      "641835": 127,
      "676684": 128,
      "628317": 129,
      "623437": 130,
      "608379": 131,
      "695243": 132,
      "676714": 133,
      "622065": 134,
      "669854": 135,
      "543475": 136,
      "641703": 137,
      "669424": 138,
      "689017": 139,
      "671111": 140,
      "621381": 141,
      "657024": 142,
      "641540": 143,
      "669276": 144,
      "675921": 145,
      "672578": 146,
      "669203": 147,
      "621051": 148,
      "679885": 149,
      "680686": 150,
      "624133": 151,
      "677020": 152,
      "642207": 153,
      "625643": 154,
      "694813": 155,
      "622491": 156,
      "686613": 157,
      "543243": 158,
      "663554": 159,
      "657240": 160,
      "571945": 161,
      "663485": 162,
      "668674": 163,
      "593423": 164,
      "571656": 165,
      "607200": 166,
      "663903": 167,
      "605400": 168,
      "669674": 169,
      "542881": 170,
      "622075": 171,
      "676395": 172,
      "641941": 173,
      "547973": 174,
      "570632": 175,
      "700187": 176,
      "641482": 177,
      "673540": 178,
      "543272": 179,
      "687330": 180,
      "571948": 181,
      "670103": 182,
      "689266": 183,
      "641771": 184,
      "669622": 185,
      "605447": 186,
      "641154": 187,
      "669684": 188,
      "667755": 189,
      "543766": 190,
      "605397": 191,
      "656353": 192,
      "683232": 193,
      "675911": 194,
      "605135": 195,
      "657277": 196,
      "489446": 197,
      "670174": 198,
      "669459": 199,
      "663574": 200,
      "694297": 201,
      "640462": 202,
      "642546": 203,
      "680730": 204,
      "527048": 205,
      "672282": 206,
      "670950": 207,
      "656629": 208,
      "571882": 209,
      "518886": 210,
      "592473": 211,
      "600921": 212,
      "658648": 213,
      "663878": 214,
      "573204": 215,
      "657053": 216,
      "621345": 217,
      "665620": 218,
      "663687": 219,
      "684320": 220,
      "593334": 221,
      "670280": 222,
      "554430": 223,
      "664076": 224,
      "622663": 225,
      "678061": 226,
      "434378": 227,
      "641302": 228,
      "605177": 229,
      "643493": 230,
      "666201": 231,
      "592351": 232,
      "650633": 233,
      "642547": 234,
      "679525": 235,
      "683155": 236,
      "600986": 237,
      "685299": 238,
      "650644": 239,
      "623465": 240,
      "641656": 241,
      "657514": 242,
      "680735": 243,
      "592426": 244,
      "664875": 245,
      "650556": 246,
      "621111": 247,
      "668678": 248,
      "621389": 249,
      "593974": 250,
      "656730": 251,
      "678495": 252,
      "548384": 253,
      "657044": 254,
      "681676": 255,
      "612434": 256,
      "675627": 257,
      "680573": 258,
      "671096": 259,
      "642232": 260,
      "571670": 261,
      "641401": 262,
      "657093": 263,
      "571578": 264,
      "543063": 265,
      "677651": 266,
      "665795": 267,
      "527054": 268,
      "601713": 269,
      "670955": 270,
      "676775": 271,
      "592332": 272,
      "680704": 273,
      "445276": 274,
      "592741": 275,
      "573124": 276,
      "607074": 277,
      "596001": 278,
      "605280": 279,
      "696136": 280,
      "664299": 281,
      "641871": 282,
      "543101": 283,
      "656288": 284,
      "677161": 285,
      "665625": 286,
      "552640": 287,
      "674285": 288,
      "680739": 289,
      "669467": 290,
      "674370": 291,
      "656557": 292,
      "682243": 293,
      "669456": 294,
      "670970": 295,
      "663738": 296,
      "593576": 297,
      "518617": 298,
      "477132": 299,
      "676614": 300,
      "681867": 301,
      "660600": 302,
      "643410": 303,
      "640451": 304,
      "622088": 305,
      "689147": 306,
      "675916": 307,
      "663567": 308,
      "642528": 309,
      "642239": 310,
      "596057": 311,
      "645261": 312,
      "543339": 313,
      "686752": 314,
      "656756": 315,
      "641585": 316,
      "687924": 317,
      "598264": 318,
      "595345": 319,
      "608638": 320,
      "669212": 321,
      "500779": 322,
      "600917": 323,
      "694973": 324,
      "663776": 325,
      "669713": 326,
      "663531": 327,
      "623211": 328,
      "608344": 329,
      "608678": 330,
      "663658": 331,
      "607455": 332,
      "669358": 333,
      "656222": 334,
      "547179": 335,
      "665622": 336,
      "607067": 337,
      "608723": 338,
      "598286": 339,
      "663556": 340,
      "661309": 341,
      "608718": 342,
      "676879": 343,
      "663474": 344,
      "663158": 345,
      "663372": 346,
      "681857": 347,
      "506433": 348,
      "502202": 349,
      "676477": 350,
      "656876": 351,
      "571927": 352,
      "592789": 353,
      "641149": 354,
      "647336": 355,
      "681517": 356,
      "663436": 357,
      "701581": 358,
      "605288": 359,
      "543351": 360,
      "656232": 361,
      "656605": 362,
      "661395": 363,
      "670059": 364,
      "641927": 365,
      "676702": 366,
      "682171": 367,
      "622072": 368,
      "672335": 369,
      "683175": 370,
      "605441": 371,
      "677958": 372,
      "660813": 373,
      "686973": 374,
      "668933": 375,
      "425794": 376,
      "657585": 377,
      "608331": 378,
      "678606": 379,
      "572020": 380,
      "518397": 381,
      "682842": 382,
      "489119": 383,
      "656427": 384,
      "543037": 385,
      "622608": 386,
      "543294": 387,
      "675540": 388,
      "571760": 389,
      "592773": 390,
      "621107": 391,
      "657612": 392,
      "664139": 393,
      "672582": 394,
      "519043": 395,
      "445926": 396,
      "622772": 397,
      "628452": 398,
      "641712": 399,
      "663432": 400,
      "663855": 401,
      "668754": 402,
      "686747": 403,
      "665871": 404,
      "518585": 405,
      "672860": 406,
      "608665": 407,
      "657571": 408,
      "650893": 409,
      "572403": 410,
      "519293": 411,
      "667463": 412,
      "663362": 413,
      "621114": 414,
      "623149": 415,
      "680891": 416,
      "666808": 417,
      "682847": 418,
      "615698": 419,
      "669062": 420,
      "608717": 421,
      "660761": 422,
      "647315": 423,
      "502171": 424,
      "650911": 425,
      "689672": 426,
      "606965": 427,
      "682990": 428,
      "592767": 429,
      "624647": 430,
      "672715": 431,
      "592094": 432,
      "676534": 433,
      "683003": 434,
      "571863": 435,
      "543238": 436,
      "672730": 437,
      "668338": 438,
      "656234": 439,
      "694738": 440,
      "642100": 441,
      "518876": 442,
      "519151": 443,
      "663462": 444,
      "676206": 445,
      "672851": 446,
      "693821": 447,
      "664747": 448,
      "669432": 449,
      "594835": 450,
      "657508": 451,
      "606303": 452,
      "666159": 453,
      "684007": 454,
      "663765": 455,
      "676760": 456,
      "621363": 457,
      "686294": 458,
      "666974": 459,
      "680694": 460,
      "666277": 461,
      "641743": 462,
      "694037": 463,
      "677053": 464,
      "680880": 465,
      "682989": 466,
      "523260": 467,
      "663947": 468,
      "573009": 469,
      "671345": 470,
      "664849": 471,
      "657649": 472,
      "643338": 473,
      "571510": 474,
      "676254": 475,
      "661403": 476,
      "605242": 477,
      "630023": 478,
      "660271": 479,
      "607625": 480,
      "623451": 481,
      "660896": 482,
      "656546": 483,
      "663542": 484,
      "455119": 485,
      "666721": 486,
      "694363": 487,
      "642048": 488,
      "670990": 489,
      "623167": 490,
      "656302": 491,
      "541640": 492,
      "666154": 493,
      "681982": 494,
      "663465": 495,
      "691587": 496,
      "669461": 497,
      "676680": 498,
      "543507": 499,
      "700363": 500,
      "643511": 501,
      "621199": 502,
      "621112": 503,
      "605218": 504,
      "542585": 505,
      "669721": 506,
      "642397": 507,
      "687830": 508,
      "666374": 509,
      "608566": 510,
      "681869": 511,
      "677960": 512,
      "657265": 513,
      "666168": 514,
      "425844": 515,
      "670241": 516,
      "605121": 517,
      "622253": 518,
      "596295": 519,
      "622259": 520,
      "592836": 521,
      "606149": 522,
      "605200": 523,
      "666214": 524,
      "687922": 525,
      "670912": 526,
      "676105": 527,
      "686580": 528,
      "642629": 529,
      "592346": 530,
      "681432": 531,
      "676961": 532,
      "670124": 533,
      "671737": 534,
      "664942": 535,
      "682051": 536,
      "542888": 537,
      "669330": 538,
      "669093": 539,
      "673513": 540,
      "656820": 541,
      "606160": 542,
      "614179": 543,
      "663969": 544,
      "571539": 545,
      "622766": 546,
      "686563": 547,
      "519326": 548,
      "656464": 549,
      "669060": 550,
      "686539": 551,
      "686610": 552,
      "571946": 553,
      "685107": 554,
      "669084": 555,
      "690916": 556,
      "668909": 557,
      "518489": 558,
      "808967": 559,
      "641329": 560,
      "642585": 561,
      "676979": 562,
      "471911": 563,
      "656271": 564,
      "493603": 565,
      "665896": 566,
      "676974": 567,
      "605452": 568,
      "502179": 569,
      "593958": 570,
      "593833": 571,
      "668390": 572,
      "661440": 573,
      "657031": 574,
      "664199": 575,
      "608334": 576,
      "669308": 577,
      "621242": 578,
      "607968": 579,
      "677955": 580,
      "642520": 581,
      "800049": 582,
      "472610": 583,
      "673929": 584,
      "689981": 585,
      "641627": 586,
      "662253": 587,
      "650671": 588,
      "668665": 589,
      "676428": 590,
      "678020": 591,
      "690986": 592,
      "663986": 593,
      "669387": 594,
      "622250": 595,
      "641729": 596,
      "670167": 597,
      "686839": 598,
      "621074": 599,
      "676962": 600,
      "665734": 601,
      "665665": 602,
      "657140": 603,
      "448179": 604,
      "657756": 605,
      "621249": 606,
      "605463": 607,
      "605513": 608,
      "664208": 609,
      "687377": 610,
      "659275": 611,
      "663978": 612,
      "642701": 613,
      "543521": 614,
      "669160": 615,
      "676282": 616,
      "672456": 617,
      "592848": 618,
      "687792": 619,
      "669211": 620,
      "621076": 621,
      "607179": 622,
      "688297": 623,
      "592229": 624,
      "681806": 625,
      "656354": 626,
      "702352": 627,
      "543518": 628,
      "656550": 629,
      "542914": 630,
      "676106": 631,
      "650895": 632,
      "672782": 633,
      "458677": 634,
      "623352": 635,
      "622251": 636,
      "607237": 637,
      "607481": 638,
      "663704": 639,
      "453268": 640,
      "594798": 641,
      "622554": 642,
      "656641": 643,
      "641755": 644,
      "641360": 645,
      "669947": 646,
      "554431": 647,
      "622786": 648,
      "681810": 649,
      "669145": 650,
      "572971": 651,
      "702674": 652,
      "518516": 653,
      "657097": 654,
      "664350": 655,
      "519008": 656,
      "621383": 657,
      "668964": 658,
      "687888": 659,
      "624522": 660,
      "687863": 661,
      "687145": 662,
      "678821": 663,
      "663941": 664,
      "678368": 665,
      "621097": 666,
      "701542": 667,
      "686218": 668,
      "687424": 669,
      "681190": 670,
      "663546": 671,
      "592288": 672,
      "622098": 673,
      "675650": 674,
      "572193": 675,
      "643361": 676,
      "663989": 677,
      "621368": 678,
      "680736": 679,
      "640444": 680,
      "605540": 681,
      "605156": 682,
      "676083": 683,
      "643377": 684,
      "669711": 685,
      "543391": 686,
      "668970": 687,
      "682967": 688,
      "663558": 689,
      "685801": 690,
      "681882": 691,
      "446372": 692,
      "595881": 693,
      "666208": 694,
      "663992": 695,
      "681066": 696,
      "667725": 697,
      "663423": 698,
      "623474": 699,
      "608032": 700,
      "607732": 701,
      "543548": 702,
      "670810": 703,
      "472551": 704,
      "669169": 705,
      "805673": 706,
      "542947": 707,
      "664126": 708,
      "570257": 709,
      "656257": 710,
      "674444": 711,
      "700249": 712,
      "669111": 713,
      "622780": 714,
      "570666": 715,
      "670102": 716,
      "687911": 717,
      "663460": 718,
      "642121": 719,
      "502624": 720,
      "696131": 721,
      "690829": 722,
      "656457": 723,
      "665048": 724,
      "677944": 725,
      "671305": 726,
      "650960": 727,
      "680732": 728,
      "666204": 729,
      "669270": 730,
      "606930": 731,
      "607644": 732,
      "664353": 733,
      "661383": 734,
      "666720": 735,
      "695076": 736,
      "681035": 737,
      "682254": 738,
      "456501": 739,
      "656186": 740,
      "676604": 741,
      "593619": 742,
      "676596": 743,
      "686826": 744,
      "641816": 745,
      "678226": 746,
      "671212": 747,
      "663804": 748,
      "669372": 749,
      "640454": 750,
      "700241": 751,
      "656970": 752,
      "607755": 753,
      "666818": 754,
      "686796": 755,
      "669724": 756,
      "594577": 757,
      "670046": 758,
      "669952": 759,
      "641726": 760,
      "678692": 761,
      "675989": 762,
      "669796": 763,
      "607188": 764,
      "680897": 765,
      "547943": 766,
      "660906": 767,
      "596082": 768,
      "623433": 769,
      "660730": 770,
      "643256": 771,
      "669620": 772,
      "690544": 773,
      "656794": 774,
      "641778": 775,
      "646242": 776,
      "595014": 777,
      "683004": 778,
      "621057": 779,
      "670036": 780,
      "592779": 781,
      "656887": 782,
      "669422": 783,
      "679358": 784,
      "671109": 785,
      "683627": 786,
      "685314": 787,
      "700669": 788,
      "681799": 789,
      "685126": 790,
      "656290": 791,
      "668834": 792,
      "650496": 793,
      "689225": 794,
      "621016": 795,
      "661269": 796,
      "571710": 797,
      "677076": 798,
      "476595": 799,
      "693312": 800,
      "700270": 801,
      "571901": 802,
      "592826": 803,
      "607359": 804,
      "660825": 805,
      "681870": 806,
      "595411": 807,
      "680689": 808,
      "668676": 809,
      "687014": 810,
      "641672": 811,
      "680723": 812,
      "681402": 813,
      "543056": 814,
      "692230": 815,
      "670219": 816,
      "683618": 817,
      "666207": 818,
      "572143": 819,
      "687798": 820,
      "671131": 821,
      "687396": 822,
      "656529": 823,
      "607457": 824,
      "679346": 825,
      "547184": 826,
      "594943": 827,
      "686799": 828,
      "656981": 829,
      "655889": 830,
      "664079": 831,
      "701643": 832,
      "641312": 833,
      "642834": 834,
      "528748": 835,
      "664776": 836,
      "605155": 837,
      "657248": 838,
      "674944": 839,
      "656924": 840,
      "676050": 841,
      "608648": 842,
      "611093": 843,
      "666163": 844,
      "595928": 845,
      "681217": 846,
      "663321": 847,
      "622503": 848,
      "692285": 849,
      "596112": 850,
      "664129": 851,
      "656814": 852,
      "668873": 853,
      "596271": 854,
      "571479": 855,
      "623381": 856,
      "621294": 857,
      "680742": 858,
      "656818": 859,
      "608328": 860,
      "670871": 861,
      "681347": 862,
      "669618": 863,
      "456713": 864,
      "656240": 865,
      "683409": 866,
      "605335": 867,
      "680744": 868,
      "656793": 869,
      "595897": 870,
      "686654": 871,
      "621053": 872,
      "694646": 873,
      "642028": 874,
      "670329": 875,
      "682052": 876,
      "677865": 877,
      "656266": 878,
      "691172": 879,
      "696147": 880,
      "664028": 881,
      "668943": 882,
      "656848": 883,
      "673380": 884,
      "656786": 885,
      "666171": 886,
      "663455": 887,
      "663385": 888,
      "683568": 889,
      "688107": 890,
      "688427": 891,
      "547001": 892,
      "685116": 893,
      "673111": 894,
      "682175": 895,
      "672391": 896,
      "676617": 897,
      "663752": 898,
      "656382": 899,
      "670183": 900,
      "660593": 901,
      "544727": 902,
      "669199": 903,
      "668968": 904,
      "621295": 905,
      "622694": 906,
      "656458": 907,
      "676969": 908,
      "502083": 909,
      "642231": 910,
      "669105": 911,
      "672552": 912,
      "686651": 913,
      "642770": 914,
      "656671": 915,
      "680572": 916,
      "685410": 917,
      "641420": 918,
      "622103": 919,
      "488984": 920,
      "668942": 921,
      "683822": 922,
      "672841": 923,
      "642578": 924,
      "592254": 925,
      "682010": 926,
      "663753": 927,
      "665001": 928,
      "657697": 929,
      "676661": 930,
      "814005": 931,
      "676689": 932,
      "641447": 933,
      "521230": 934,
      "691441": 935,
      "691951": 936,
      "694361": 937,
      "673858": 938,
      "605446": 939,
      "660787": 940,
      "680232": 941,
      "686642": 942,
      "668984": 943,
      "543901": 944,
      "677976": 945,
      "620454": 946,
      "620982": 947,
      "664123": 948,
      "664351": 949,
      "646241": 950,
      "680983": 951,
      "679156": 952,
      "667427": 953,
      "687362": 954,
      "543594": 955,
      "664948": 956,
      "641582": 957,
      "641427": 958,
      "656986": 959,
      "694350": 960,
      "656322": 961,
      "703231": 962,
      "570731": 963,
      "666215": 964,
      "663767": 965,
      "686751": 966,
      "657424": 967,
      "607216": 968,
      "689167": 969,
      "621139": 970,
      "669165": 971,
      "542882": 972,
      "606625": 973,
      "660644": 974,
      "689958": 975,
      "592390": 976,
      "683068": 977,
      "676508": 978,
      "642758": 979,
      "657272": 980,
      "656420": 981,
      "592527": 982,
      "517008": 983,
      "657193": 984,
      "686993": 985,
      "669391": 986,
      "670161": 987,
      "571616": 988,
      "668470": 989,
      "681808": 990,
      "629498": 991,
      "694462": 992,
      "668874": 993,
      "663629": 994,
      "605151": 995,
      "678906": 996,
      "642016": 997,
      "674681": 998,
      "681871": 999,
      "641658": 1000,
      "676568": 1001,
      "656716": 1002,
      "686972": 1003,
      "686842": 1004,
      "621219": 1005,
      "664202": 1006,
      "676701": 1007,
      "572888": 1008,
      "663971": 1009,
      "545121": 1010,
      "676755": 1011,
      "657041": 1012,
      "660431": 1013,
      "622569": 1014,
      "690925": 1015,
      "702795": 1016,
      "695549": 1017,
      "676475": 1018,
      "571527": 1019,
      "621399": 1020,
      "681987": 1021,
      "656896": 1022,
      "670097": 1023,
      "686790": 1024,
      "622110": 1025,
      "691094": 1026,
      "664744": 1027,
      "667478": 1028,
      "518626": 1029,
      "682073": 1030,
      "676632": 1031,
      "641343": 1032,
      "596117": 1033,
      "687847": 1034,
      "593934": 1035,
      "645801": 1036,
      "571771": 1037,
      "679845": 1038,
      "592222": 1039,
      "683021": 1040
    },
    "batter": {
      "663697": 1,
      "672478": 2,
      "657656": 3,
      "681146": 4,
      "572041": 5,
      "662139": 6,
      "624415": 7,
      "676391": 8,
      "663757": 9,
      "672012": 10,
      "607208": 11,
      "642350": 12,
      "681082": 13,
      "592518": 14,
      "656811": 15,
      "642136": 16,
      "668715": 17,
      "621566": 18,
      "657077": 19,
      "657557": 20,
      "663656": 21,
      "663586": 22,
      "687597": 23,
      "446334": 24,
      "592206": 25,
      "670764": 26,
      "673237": 27,
      "592696": 28,
      "669394": 29,
      "571448": 30,
      "645277": 31,
      "664034": 32,
      "669004": 33,
      "641343": 34,
      "660766": 35,
      "641857": 36,
      "664901": 37,
      "641487": 38,
      "676609": 39,
      "572138": 40,
      "668804": 41,
      "606192": 42,
      "669224": 43,
      "572761": 44,
      "542303": 45,
      "681297": 46,
      "592325": 47,
      "678009": 48,
      "543760": 49,
      "665489": 50,
      "596146": 51,
      "605137": 52,
      "607043": 53,
      "642731": 54,
      "672275": 55,
      "665833": 56,
      "500871": 57,
      "666176": 58,
      "647304": 59,
      "656976": 60,
      "666182": 61,
      "660821": 62,
      "667472": 63,
      "670242": 64,
      "457759": 65,
      "670042": 66,
      "663993": 67,
      "672580": 68,
      "668904": 69,
      "661388": 70,
      "669397": 71,
      "606992": 72,
      "666971": 73,
      "667670": 74,
      "606466": 75,
      "682829": 76,
      "572233": 77,
      "682641": 78,
      "592192": 79,
      "683011": 80,
      "592273": 81,
      "664023": 82,
      "686469": 83,
      "683737": 84,
      "669261": 85,
      "680869": 86,
      "543068": 87,
      "545341": 88,
      "669257": 89,
      "624585": 90,
      "686668": 91,
      "657041": 92,
      "642180": 93,
      "665161": 94,
      "671739": 95,
      "668723": 96,
      "543685": 97,
      "571970": 98,
      "670623": 99,
      "664761": 100,
      "663538": 101,
      "656775": 102,
      "621043": 103,
      "649557": 104,
      "519317": 105,
      "595879": 106,
      "686217": 107,
      "545361": 108,
      "660688": 109,
      "518595": 110,
      "665742": 111,
      "668472": 112,
      "519058": 113,
      "682868": 114,
      "665120": 115,
      "665019": 116,
      "669222": 117,
      "592885": 118,
      "502671": 119,
      "677941": 120,
      "676694": 121,
      "622761": 122,
      "666181": 123,
      "668939": 124,
      "650333": 125,
      "606132": 126,
      "664040": 127,
      "670770": 128,
      "641355": 129,
      "666310": 130,
      "467793": 131,
      "578428": 132,
      "682985": 133,
      "672640": 134,
      "605131": 135,
      "521692": 136,
      "669701": 137,
      "677951": 138,
      "623993": 139,
      "701538": 140,
      "622534": 141,
      "669221": 142,
      "543063": 143,
      "677588": 144,
      "543305": 145,
      "681546": 146,
      "657061": 147,
      "672515": 148,
      "642715": 149,
      "680474": 150,
      "608324": 151,
      "606115": 152,
      "656448": 153,
      "656941": 154,
      "641432": 155,
      "664702": 156,
      "595956": 157,
      "456781": 158,
      "643217": 159,
      "672695": 160,
      "686823": 161,
      "669720": 162,
      "645801": 163,
      "527038": 164,
      "668670": 165,
      "630105": 166,
      "660271": 167,
      "666134": 168,
      "643289": 169,
      "543877": 170,
      "669134": 171,
      "547989": 172,
      "553993": 173,
      "668731": 174,
      "660670": 175,
      "624428": 176,
      "650559": 177,
      "670097": 178,
      "607680": 179,
      "680757": 180,
      "682998": 181,
      "680777": 182,
      "665561": 183,
      "669364": 184,
      "656305": 185,
      "672820": 186,
      "545121": 187,
      "624413": 188,
      "624424": 189,
      "641658": 190,
      "677649": 191,
      "680776": 192,
      "643393": 193,
      "572816": 194,
      "673357": 195,
      "658668": 196,
      "683146": 197,
      "608385": 198,
      "677551": 199,
      "671213": 200,
      "669357": 201,
      "643565": 202,
      "663728": 203,
      "673490": 204,
      "666149": 205,
      "680977": 206,
      "595281": 207,
      "669289": 208,
      "624641": 209,
      "621020": 210,
      "669911": 211,
      "621439": 212,
      "519203": 213,
      "672356": 214,
      "677950": 215,
      "656577": 216,
      "663898": 217,
      "665926": 218,
      "641933": 219,
      "676914": 220,
      "702358": 221,
      "672386": 222,
      "457705": 223,
      "666164": 224,
      "643446": 225,
      "624503": 226,
      "493329": 227,
      "543257": 228,
      "663368": 229,
      "664983": 230,
      "676475": 231,
      "502054": 232,
      "663837": 233,
      "643376": 234,
      "665750": 235,
      "596117": 236,
      "668227": 237,
      "676480": 238,
      "670223": 239,
      "679881": 240,
      "683734": 241,
      "663457": 242,
      "665487": 243,
      "571912": 244,
      "678882": 245,
      "682928": 246,
      "514888": 247,
      "669707": 248,
      "595751": 249,
      "666139": 250,
      "608070": 251,
      "657757": 252,
      "668930": 253,
      "656413": 254,
      "547180": 255,
      "656582": 256,
      "660644": 257,
      "609280": 258,
      "666018": 259,
      "646240": 260,
      "671277": 261,
      "682177": 262,
      "455117": 263,
      "594777": 264,
      "518792": 265,
      "607054": 266,
      "641584": 267,
      "592669": 268,
      "668709": 269,
      "694192": 270,
      "666152": 271,
      "660162": 272,
      "681624": 273,
      "666969": 274,
      "664056": 275,
      "668845": 276,
      "516782": 277,
      "669242": 278,
      "571745": 279,
      "645444": 280,
      "628451": 281,
      "592663": 282,
      "624431": 283,
      "671218": 284,
      "596019": 285,
      "672279": 286,
      "690993": 287,
      "605141": 288,
      "666185": 289,
      "641856": 290,
      "663886": 291,
      "683002": 292,
      "641680": 293,
      "696285": 294,
      "673962": 295,
      "666160": 296,
      "443558": 297,
      "669450": 298,
      "665804": 299,
      "677587": 300,
      "682617": 301,
      "663853": 302,
      "672761": 303,
      "500743": 304,
      "572191": 305,
      "621563": 306,
      "665828": 307,
      "688363": 308,
      "650489": 309,
      "656896": 310,
      "687462": 311,
      "607732": 312,
      "571657": 313,
      "677594": 314,
      "595777": 315,
      "592450": 316,
      "621493": 317,
      "668942": 318,
      "664238": 319,
      "671732": 320,
      "656555": 321,
      "673548": 322,
      "643396": 323,
      "593160": 324,
      "595978": 325,
      "657136": 326,
      "650391": 327,
      "621466": 328,
      "642086": 329,
      "675986": 330,
      "642133": 331,
      "575929": 332,
      "678225": 333,
      "664913": 334,
      "807799": 335,
      "665155": 336,
      "700250": 337,
      "605361": 338,
      "679529": 339,
      "613564": 340,
      "669016": 341,
      "605170": 342,
      "518735": 343,
      "592626": 344,
      "553869": 345,
      "681481": 346,
      "502110": 347,
      "696100": 348,
      "668853": 349,
      "668901": 350,
      "667452": 351,
      "666135": 352,
      "677800": 353,
      "605113": 354,
      "682626": 355,
      "570731": 356,
      "665839": 357,
      "664774": 358,
      "543807": 359,
      "666464": 360,
      "605204": 361,
      "669065": 362,
      "695391": 363,
      "691026": 364,
      "650907": 365,
      "666158": 366,
      "553882": 367,
      "672284": 368,
      "656537": 369,
      "678662": 370,
      "682073": 371,
      "624512": 372,
      "600869": 373,
      "663611": 374,
      "595909": 375,
      "668832": 376,
      "621035": 377,
      "676116": 378,
      "682515": 379,
      "675656": 380,
      "660844": 381,
      "694497": 382,
      "676701": 383,
      "621438": 384,
      "670032": 385,
      "666197": 386,
      "665923": 387,
      "570482": 388,
      "669127": 389,
      "596129": 390,
      "595453": 391,
      "663698": 392,
      "543510": 393,
      "545350": 394,
      "670156": 395,
      "691406": 396,
      "593934": 397,
      "641598": 398,
      "608348": 399,
      "655316": 400,
      "608369": 401,
      "672724": 402,
      "666703": 403,
      "665862": 404,
      "669743": 405,
      "621311": 406,
      "542932": 407,
      "602104": 408,
      "663647": 409,
      "679032": 410,
      "608841": 411,
      "592178": 412,
      "543939": 413,
      "642708": 414,
      "462101": 415,
      "641820": 416,
      "621458": 417,
      "677592": 418,
      "605119": 419,
      "623912": 420,
      "543309": 421,
      "644433": 422,
      "608671": 423,
      "593428": 424,
      "666801": 425,
      "664029": 426,
      "664728": 427,
      "666624": 428,
      "641505": 429,
      "650859": 430,
      "693049": 431,
      "671083": 432,
      "670541": 433,
      "669304": 434,
      "682622": 435,
      "676724": 436,
      "686681": 437,
      "694384": 438,
      "641511": 439,
      "687263": 440,
      "656541": 441,
      "621550": 442,
      "686894": 443,
      "678894": 444,
      "681351": 445,
      "686676": 446,
      "543228": 447,
      "686780": 448,
      "672779": 449,
      "663527": 450,
      "518692": 451,
      "689172": 452,
      "663330": 453,
      "649966": 454,
      "680911": 455,
      "665506": 456,
      "518934": 457,
      "596103": 458,
      "663616": 459,
      "677008": 460,
      "664954": 461,
      "453568": 462,
      "596059": 463,
      "656716": 464,
      "573262": 465,
      "676801": 466,
      "642336": 467,
      "643265": 468,
      "694376": 469,
      "444482": 470,
      "691783": 471,
      "666150": 472,
      "641943": 473,
      "669477": 474,
      "656495": 475,
      "571771": 476,
      "693304": 477,
      "608336": 478,
      "671221": 479,
      "682729": 480,
      "641313": 481,
      "681393": 482,
      "593871": 483,
      "694671": 484,
      "680574": 485,
      "650402": 486,
      "657247": 487,
      "661531": 488,
      "518626": 489,
      "572228": 490,
      "666397": 491,
      "516416": 492,
      "666163": 493,
      "670276": 494,
      "681807": 495,
      "645305": 496,
      "680779": 497,
      "663743": 498,
      "542583": 499,
      "571466": 500,
      "542194": 501,
      "687401": 502,
      "680700": 503,
      "676059": 504,
      "680718": 505,
      "669352": 506,
      "542208": 507,
      "676070": 508,
      "694388": 509,
      "663624": 510,
      "672744": 511,
      "687952": 512,
      "622569": 513,
      "666023": 514,
      "694359": 515,
      "408234": 516,
      "691023": 517,
      "678246": 518,
      "681584": 519,
      "668885": 520,
      "650490": 521,
      "687093": 522,
      "686554": 523,
      "670712": 524,
      "695578": 525,
      "506702": 526,
      "656180": 527,
      "641645": 528,
      "660707": 529,
      "678877": 530,
      "656484": 531,
      "621545": 532,
      "571976": 533,
      "677347": 534,
      "623205": 535,
      "594807": 536,
      "691718": 537,
      "679631": 538,
      "686527": 539,
      "605421": 540,
      "675961": 541,
      "669003": 542,
      "640457": 543,
      "669234": 544,
      "596142": 545,
      "642851": 546,
      "598265": 547,
      "663630": 548,
      "676356": 549,
      "664314": 550,
      "571875": 551,
      "702616": 552,
      "691016": 553,
      "671289": 554,
      "686797": 555,
      "693307": 556,
      "695336": 557,
      "672569": 558,
      "656308": 559,
      "691723": 560,
      "669369": 561,
      "474832": 562,
      "680118": 563,
      "621433": 564,
      "621028": 565,
      "663609": 566,
      "623507": 567,
      "680728": 568,
      "700242": 569,
      "572008": 570,
      "664058": 571,
      "681962": 572,
      "669374": 573,
      "666165": 574,
      "677870": 575,
      "686452": 576,
      "682657": 577,
      "808982": 578,
      "664059": 579,
      "680769": 580,
      "663845": 581,
      "620443": 582,
      "542364": 583,
      "596115": 584,
      "678554": 585,
      "679845": 586,
      "614177": 587,
      "695238": 588,
      "608701": 589,
      "690291": 590,
      "663550": 591,
      "663662": 592,
      "683083": 593,
      "647351": 594,
      "666915": 595,
      "676369": 596,
      "671056": 597,
      "694377": 598,
      "678545": 599,
      "641779": 600,
      "673995": 601,
      "642197": 602,
      "592200": 603,
      "624414": 604,
      "660757": 605,
      "621512": 606,
      "668800": 607,
      "691176": 608,
      "665953": 609,
      "680814": 610,
      "680737": 611,
      "642215": 612,
      "572204": 613,
      "623168": 614,
      "644374": 615,
      "700932": 616,
      "645302": 617,
      "664874": 618,
      "641531": 619,
      "605346": 620,
      "663731": 621,
      "656514": 622,
      "687799": 623,
      "665782": 624,
      "592348": 625,
      "668843": 626,
      "663796": 627,
      "572287": 628,
      "668952": 629,
      "640449": 630,
      "666906": 631,
      "686555": 632,
      "683021": 633,
      "656248": 634,
      "685133": 635,
      "686765": 636,
      "605612": 637,
      "458015": 638,
      "687363": 639,
      "622110": 640,
      "672642": 641,
      "682848": 642,
      "676113": 643,
      "664057": 644,
      "663967": 645,
      "657088": 646,
      "656024": 647,
      "608596": 648,
      "687231": 649,
      "676632": 650,
      "669742": 651,
      "663897": 652,
      "573131": 653,
      "679822": 654,
      "663905": 655,
      "666198": 656,
      "656669": 657,
      "805779": 658,
      "677942": 659,
      "602074": 660,
      "686531": 661,
      "543281": 662,
      "695257": 663,
      "543592": 664,
      "665877": 665,
      "666211": 666,
      "640902": 667,
      "660620": 668,
      "694362": 669,
      "670224": 670,
      "592656": 671,
      "642137": 672,
      "687529": 673,
      "669087": 674,
      "541645": 675,
      "691594": 676,
      "681460": 677,
      "676572": 678,
      "677595": 679,
      "669326": 680,
      "674441": 681,
      "665052": 682,
      "607461": 683,
      "671286": 684,
      "686482": 685,
      "622666": 686,
      "660636": 687,
      "680716": 688,
      "640458": 689,
      "650619": 690,
      "682668": 691,
      "641786": 692,
      "547379": 693,
      "676679": 694,
      "543518": 695,
      "686759": 696,
      "677956": 697,
      "676946": 698,
      "691011": 699,
      "656403": 700,
      "682988": 701,
      "543333": 702,
      "600301": 703,
      "686611": 704,
      "669699": 705,
      "543543": 706,
      "623520": 707,
      "642020": 708,
      "664770": 709,
      "596847": 710,
      "593643": 711,
      "640492": 712,
      "691182": 713,
      "669208": 714,
      "664247": 715,
      "669200": 716,
      "605244": 717,
      "701305": 718,
      "614173": 719,
      "667428": 720,
      "641525": 721,
      "543482": 722,
      "600303": 723,
      "642201": 724,
      "670092": 725,
      "542963": 726,
      "641553": 727,
      "518586": 728,
      "425794": 729,
      "488726": 730,
      "669137": 731,
      "680577": 732,
      "678489": 733,
      "669392": 734,
      "681987": 735,
      "656185": 736,
      "663604": 737,
      "501303": 738,
      "665966": 739,
      "657193": 740,
      "444489": 741,
      "805373": 742,
      "660634": 743,
      "641796": 744,
      "670869": 745,
      "672701": 746,
      "571740": 747,
      "669023": 748,
      "686490": 749,
      "670128": 750,
      "501659": 751,
      "608703": 752,
      "676761": 753,
      "578570": 754,
      "656821": 755,
      "660758": 756,
      "571980": 757,
      "676439": 758,
      "694355": 759,
      "680418": 760,
      "676551": 761,
      "694175": 762,
      "605242": 763,
      "687957": 764,
      "681508": 765,
      "643348": 766,
      "675659": 767,
      "621532": 768,
      "622491": 769,
      "622268": 770,
      "668751": 771,
      "668752": 772,
      "682634": 773,
      "676896": 774,
      "656371": 775,
      "682619": 776,
      "656883": 777,
      "671117": 778,
      "641470": 779,
      "665856": 780,
      "668663": 781,
      "687066": 782,
      "682119": 783,
      "595284": 784,
      "676625": 785,
      "608360": 786,
      "664670": 787,
      "675915": 788
    },
    "stand": {
      "R": 1,
      "L": 2
    },
    "p_throws": {
      "R": 1,
      "L": 2
    },
    "inning_topbot": {
      "Bot": 1,
      "Top": 2
    },
    "count_state": {
      "0-0": 1,
      "1-0": 2,
      "3-2": 3,
      "1-1": 4,
      "1-2": 5,
      "2-0": 6,
      "0-1": 7,
      "2-2": 8,
      "0-2": 9,
      "3-1": 10,
      "2-1": 11,
      "3-0": 12
    },
    "prev_pitch_type": {
      "START": 1,
      "SI": 2,
      "SL": 3,
      "CH": 4,
      "FF": 5,
      "CU": 6,
      "ST": 7,
      "FC": 8,
      "FS": 9,
      "KC": 10,
      "SV": 11,
      "KN": 12,
      "FO": 13,
      "SC": 14,
      "FA": 15,
      "PO": 16,
      "EP": 17,
      "CS": 18
    },
    "base_state": {
      "1": 1,
      "0": 2,
      "7": 3,
      "2": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "6": 8
    }
  },
  "y_vocab": {
    "KC": 1,
    "SL": 2,
    "CU": 3,
    "ST": 4,
    "SV": 5
  },
  "feature_spec": {
    "target": "y_next_pitch_breaking",
    "cat_cols": [
      "pitcher",
      "batter",
      "stand",
      "p_throws",
      "inning_topbot",
      "count_state",
      "prev_pitch_type",
      "base_state"
    ],
    "num_cols": [
      "outs_when_up",
      "inning",
      "bat_score_diff",
      "pitcher_sit_fb_rate",
      "pitcher_sit_br_rate",
      "pitcher_sit_os_rate",
      "pitcher_sit_whiff_rate",
      "batter_sit_swing_rate",
      "batter_sit_whiff_rate"
    ]
  },
  "exported_at": "2026-05-10T22:13:17.624561"
}